## Plan Result (prod-uksouth-prod)




<pre><code>Plan: 635 to add, 0 to change, 0 to destroy.</code></pre>

* Create
  * module.appeal-benefit.azurerm_dns_cname_record.this[&#34;afdverify.www&#34;]
  * module.appeal-benefit.azurerm_dns_cname_record.this[&#34;afdverify.www.manage&#34;]
  * module.appeal-benefit.azurerm_dns_cname_record.this[&#34;cdnverify.www&#34;]
  * module.appeal-benefit.azurerm_dns_cname_record.this[&#34;cdnverify.www.manage&#34;]
  * module.appeal-benefit.azurerm_dns_cname_record.this[&#34;manage&#34;]
  * module.appeal-benefit.azurerm_dns_cname_record.this[&#34;www&#34;]
  * module.appeal-benefit.azurerm_dns_cname_record.this[&#34;www.manage&#34;]
  * module.appeal-benefit.azurerm_dns_zone.zone
  * module.appeal-benefit.azurerm_role_assignment.dnszonecontributer
  * module.appeal-immigration.azurerm_dns_cname_record.this[&#34;afdverify.www&#34;]
  * module.appeal-immigration.azurerm_dns_cname_record.this[&#34;cdnverify.www&#34;]
  * module.appeal-immigration.azurerm_dns_cname_record.this[&#34;www&#34;]
  * module.appeal-immigration.azurerm_dns_zone.zone
  * module.appeal-immigration.azurerm_role_assignment.dnszonecontributer
  * module.apply-divorce.azurerm_dns_cname_record.this[&#34;*&#34;]
  * module.apply-divorce.azurerm_dns_cname_record.this[&#34;afdverify.www&#34;]
  * module.apply-divorce.azurerm_dns_cname_record.this[&#34;afdverify.www.decree-absolute&#34;]
  * module.apply-divorce.azurerm_dns_cname_record.this[&#34;afdverify.www.decree-nisi&#34;]
  * module.apply-divorce.azurerm_dns_cname_record.this[&#34;afdverify.www.manage-application&#34;]
  * module.apply-divorce.azurerm_dns_cname_record.this[&#34;cdnverify.www&#34;]
  * module.apply-divorce.azurerm_dns_cname_record.this[&#34;cdnverify.www.decree-absolute&#34;]
  * module.apply-divorce.azurerm_dns_cname_record.this[&#34;cdnverify.www.decree-nisi&#34;]
  * module.apply-divorce.azurerm_dns_cname_record.this[&#34;cdnverify.www.manage-application&#34;]
  * module.apply-divorce.azurerm_dns_cname_record.this[&#34;decree-absolute&#34;]
  * module.apply-divorce.azurerm_dns_cname_record.this[&#34;decree-nisi&#34;]
  * module.apply-divorce.azurerm_dns_cname_record.this[&#34;manage-application&#34;]
  * module.apply-divorce.azurerm_dns_cname_record.this[&#34;www&#34;]
  * module.apply-divorce.azurerm_dns_cname_record.this[&#34;www.decree-absolute&#34;]
  * module.apply-divorce.azurerm_dns_cname_record.this[&#34;www.decree-nisi&#34;]
  * module.apply-divorce.azurerm_dns_cname_record.this[&#34;www.manage-application&#34;]
  * module.apply-divorce.azurerm_dns_txt_record.this[&#34;_dnsauth.www&#34;]
  * module.apply-divorce.azurerm_dns_zone.zone
  * module.apply-divorce.azurerm_role_assignment.dnszonecontributer
  * module.apply-for-probate.azurerm_dns_a_record.this[&#34;@&#34;]
  * module.apply-for-probate.azurerm_dns_cname_record.this[&#34;afdverify.www&#34;]
  * module.apply-for-probate.azurerm_dns_cname_record.this[&#34;cdnverify.www&#34;]
  * module.apply-for-probate.azurerm_dns_cname_record.this[&#34;www&#34;]
  * module.apply-for-probate.azurerm_dns_zone.zone
  * module.apply-for-probate.azurerm_role_assignment.dnszonecontributer
  * module.apps-hmcts.azurerm_dns_cname_record.this[&#34;caps&#34;]
  * module.apps-hmcts.azurerm_dns_cname_record.this[&#34;cman&#34;]
  * module.apps-hmcts.azurerm_dns_zone.zone
  * module.apps-hmcts.azurerm_role_assignment.dnszonecontributer
  * module.apps-nle-hmcts.azurerm_dns_a_record.this[&#34;sdt-uks&#34;]
  * module.apps-nle-hmcts.azurerm_dns_a_record.this[&#34;sdt-ukw&#34;]
  * module.apps-nle-hmcts.azurerm_dns_a_record.this[&#34;sdtcomm-uks&#34;]
  * module.apps-nle-hmcts.azurerm_dns_a_record.this[&#34;sdtcomm-ukw&#34;]
  * module.apps-nle-hmcts.azurerm_dns_cname_record.this[&#34;caps&#34;]
  * module.apps-nle-hmcts.azurerm_dns_cname_record.this[&#34;cman&#34;]
  * module.apps-nle-hmcts.azurerm_dns_cname_record.this[&#34;mcnotify&#34;]
  * module.apps-nle-hmcts.azurerm_dns_cname_record.this[&#34;mcol&#34;]
  * module.apps-nle-hmcts.azurerm_dns_cname_record.this[&#34;pcnotify&#34;]
  * module.apps-nle-hmcts.azurerm_dns_cname_record.this[&#34;pcol&#34;]
  * module.apps-nle-hmcts.azurerm_dns_cname_record.this[&#34;sdt&#34;]
  * module.apps-nle-hmcts.azurerm_dns_cname_record.this[&#34;sdtcomm&#34;]
  * module.apps-nle-hmcts.azurerm_dns_cname_record.this[&#34;testclaim-pcol&#34;]
  * module.apps-nle-hmcts.azurerm_dns_zone.zone
  * module.apps-nle-hmcts.azurerm_role_assignment.dnszonecontributer
  * module.c100-application.azurerm_dns_cname_record.this[&#34;afdverify.c100-application&#34;]
  * module.c100-application.azurerm_dns_cname_record.this[&#34;c100-application&#34;]
  * module.c100-application.azurerm_dns_cname_record.this[&#34;cdnverify.c100-application&#34;]
  * module.c100-application.azurerm_dns_zone.zone
  * module.c100-application.azurerm_role_assignment.dnszonecontributer
  * module.casetracker.azurerm_dns_a_record.this[&#34;@&#34;]
  * module.casetracker.azurerm_dns_cname_record.this[&#34;afdverify.dev&#34;]
  * module.casetracker.azurerm_dns_cname_record.this[&#34;afdverify.staging&#34;]
  * module.casetracker.azurerm_dns_cname_record.this[&#34;dev&#34;]
  * module.casetracker.azurerm_dns_cname_record.this[&#34;staging&#34;]
  * module.casetracker.azurerm_dns_zone.zone
  * module.casetracker.azurerm_role_assignment.dnszonecontributer
  * module.certificatedbailiffs.azurerm_dns_a_record.this[&#34;@&#34;]
  * module.certificatedbailiffs.azurerm_dns_cname_record.this[&#34;afdverify.dev&#34;]
  * module.certificatedbailiffs.azurerm_dns_cname_record.this[&#34;afdverify.staging&#34;]
  * module.certificatedbailiffs.azurerm_dns_cname_record.this[&#34;dev&#34;]
  * module.certificatedbailiffs.azurerm_dns_cname_record.this[&#34;staging&#34;]
  * module.certificatedbailiffs.azurerm_dns_zone.zone
  * module.certificatedbailiffs.azurerm_role_assignment.dnszonecontributer
  * module.courtfines.azurerm_dns_a_record.this[&#34;@&#34;]
  * module.courtfines.azurerm_dns_cname_record.this[&#34;afdverify.dev&#34;]
  * module.courtfines.azurerm_dns_cname_record.this[&#34;afdverify.staging&#34;]
  * module.courtfines.azurerm_dns_cname_record.this[&#34;dev&#34;]
  * module.courtfines.azurerm_dns_cname_record.this[&#34;staging&#34;]
  * module.courtfines.azurerm_dns_zone.zone
  * module.courtfines.azurerm_role_assignment.dnszonecontributer
  * module.courttribunalfinder.azurerm_dns_cname_record.this[&#34;hw2mzkztnolp&#34;]
  * module.courttribunalfinder.azurerm_dns_cname_record.this[&#34;www&#34;]
  * module.courttribunalfinder.azurerm_dns_txt_record.this[&#34;@&#34;]
  * module.courttribunalfinder.azurerm_dns_txt_record.this[&#34;_smtp._tls&#34;]
  * module.courttribunalfinder.azurerm_dns_zone.zone
  * module.courttribunalfinder.azurerm_role_assignment.dnszonecontributer
  * module.ctsc-hmcts.azurerm_dns_a_record.this[&#34;survey&#34;]
  * module.ctsc-hmcts.azurerm_dns_a_record.this[&#34;survey.preprod&#34;]
  * module.ctsc-hmcts.azurerm_dns_a_record.this[&#34;survey.training&#34;]
  * module.ctsc-hmcts.azurerm_dns_a_record.this[&#34;webchat&#34;]
  * module.ctsc-hmcts.azurerm_dns_a_record.this[&#34;webchat-client&#34;]
  * module.ctsc-hmcts.azurerm_dns_a_record.this[&#34;webchat-client.pp&#34;]
  * module.ctsc-hmcts.azurerm_dns_a_record.this[&#34;webchat-client.training&#34;]
  * module.ctsc-hmcts.azurerm_dns_a_record.this[&#34;webchat.pp&#34;]
  * module.ctsc-hmcts.azurerm_dns_a_record.this[&#34;webchat.training&#34;]
  * module.ctsc-hmcts.azurerm_dns_a_record.this[&#34;wfmapp&#34;]
  * module.ctsc-hmcts.azurerm_dns_a_record.this[&#34;wfmapp.preprod&#34;]
  * module.ctsc-hmcts.azurerm_dns_a_record.this[&#34;wfmapp.training&#34;]
  * module.ctsc-hmcts.azurerm_dns_cname_record.this[&#34;_1B5821763E18AFEBF93B9B48B49B6736.webchat&#34;]
  * module.ctsc-hmcts.azurerm_dns_cname_record.this[&#34;_5094A556B4B6EDD71A798B02182264C2.webchat-client&#34;]
  * module.ctsc-hmcts.azurerm_dns_cname_record.this[&#34;_8E6632D6F7B6D9D1DCCE0F0567B4B822.survey.preprod&#34;]
  * module.ctsc-hmcts.azurerm_dns_cname_record.this[&#34;_8E6632D6F7B6D9D1DCCE0F0567B4B822.survey.training&#34;]
  * module.ctsc-hmcts.azurerm_dns_cname_record.this[&#34;_A218E9DEFE224C14633D06BC37AB1216.wfmapp&#34;]
  * module.ctsc-hmcts.azurerm_dns_cname_record.this[&#34;_B3206FCFEEB16A87A7AE2328971DB3C9.survey&#34;]
  * module.ctsc-hmcts.azurerm_dns_cname_record.this[&#34;_E0BDCD3E999D84AEC133A95F71EE1F18.wfmapp.preprod&#34;]
  * module.ctsc-hmcts.azurerm_dns_cname_record.this[&#34;_E0BDCD3E999D84AEC133A95F71EE1F18.wfmapp.training&#34;]
  * module.ctsc-hmcts.azurerm_dns_zone.zone
  * module.ctsc-hmcts.azurerm_role_assignment.dnszonecontributer
  * module.darts-nle-service.azurerm_dns_a_record.this[&#34;@&#34;]
  * module.darts-nle-service.azurerm_dns_ns_record.this[&#34;@&#34;]
  * module.darts-nle-service.azurerm_dns_zone.zone
  * module.darts-nle-service.azurerm_role_assignment.dnszonecontributer
  * module.darts-service.azurerm_dns_a_record.this[&#34;@&#34;]
  * module.darts-service.azurerm_dns_ns_record.this[&#34;@&#34;]
  * module.darts-service.azurerm_dns_zone.zone
  * module.darts-service.azurerm_role_assignment.dnszonecontributer
  * module.end-civil-partnership.azurerm_dns_cname_record.this[&#34;*&#34;]
  * module.end-civil-partnership.azurerm_dns_cname_record.this[&#34;afdverify.www&#34;]
  * module.end-civil-partnership.azurerm_dns_cname_record.this[&#34;cdnverify.www&#34;]
  * module.end-civil-partnership.azurerm_dns_cname_record.this[&#34;www&#34;]
  * module.end-civil-partnership.azurerm_dns_zone.zone
  * module.end-civil-partnership.azurerm_role_assignment.dnszonecontributer
  * module.erupload-justice.azurerm_dns_zone.zone
  * module.erupload-justice.azurerm_role_assignment.dnszonecontributer
  * module.eruploadtest-justice.azurerm_dns_zone.zone
  * module.eruploadtest-justice.azurerm_role_assignment.dnszonecontributer
  * module.find-court-tribunal.azurerm_dns_cname_record.this[&#34;admin&#34;]
  * module.find-court-tribunal.azurerm_dns_cname_record.this[&#34;afdverify.www&#34;]
  * module.find-court-tribunal.azurerm_dns_cname_record.this[&#34;afdverify.www.admin&#34;]
  * module.find-court-tribunal.azurerm_dns_cname_record.this[&#34;cdnverify.admin&#34;]
  * module.find-court-tribunal.azurerm_dns_cname_record.this[&#34;cdnverify.www&#34;]
  * module.find-court-tribunal.azurerm_dns_cname_record.this[&#34;cdnverify.www.admin&#34;]
  * module.find-court-tribunal.azurerm_dns_cname_record.this[&#34;www&#34;]
  * module.find-court-tribunal.azurerm_dns_zone.zone
  * module.find-court-tribunal.azurerm_role_assignment.dnszonecontributer
  * module.hearings.azurerm_dns_a_record.this[&#34;@&#34;]
  * module.hearings.azurerm_dns_a_record.this[&#34;dev&#34;]
  * module.hearings.azurerm_dns_a_record.this[&#34;dev.self-test&#34;]
  * module.hearings.azurerm_dns_a_record.this[&#34;join&#34;]
  * module.hearings.azurerm_dns_a_record.this[&#34;join.dev&#34;]
  * module.hearings.azurerm_dns_a_record.this[&#34;join.dev.self-test&#34;]
  * module.hearings.azurerm_dns_a_record.this[&#34;join.preprod&#34;]
  * module.hearings.azurerm_dns_a_record.this[&#34;join.preprod.self-test&#34;]
  * module.hearings.azurerm_dns_a_record.this[&#34;join.self-test&#34;]
  * module.hearings.azurerm_dns_a_record.this[&#34;join.test&#34;]
  * module.hearings.azurerm_dns_a_record.this[&#34;join.test.self-test&#34;]
  * module.hearings.azurerm_dns_a_record.this[&#34;join.test2&#34;]
  * module.hearings.azurerm_dns_a_record.this[&#34;preprod&#34;]
  * module.hearings.azurerm_dns_a_record.this[&#34;preprod.self-test&#34;]
  * module.hearings.azurerm_dns_a_record.this[&#34;px01&#34;]
  * module.hearings.azurerm_dns_a_record.this[&#34;px01.dev&#34;]
  * module.hearings.azurerm_dns_a_record.this[&#34;px01.dev.self-test&#34;]
  * module.hearings.azurerm_dns_a_record.this[&#34;px01.preprod&#34;]
  * module.hearings.azurerm_dns_a_record.this[&#34;px01.preprod.self-test&#34;]
  * module.hearings.azurerm_dns_a_record.this[&#34;px01.self-test&#34;]
  * module.hearings.azurerm_dns_a_record.this[&#34;px01.test&#34;]
  * module.hearings.azurerm_dns_a_record.this[&#34;px01.test.self-test&#34;]
  * module.hearings.azurerm_dns_a_record.this[&#34;px01.test2&#34;]
  * module.hearings.azurerm_dns_a_record.this[&#34;px02&#34;]
  * module.hearings.azurerm_dns_a_record.this[&#34;px02.dev&#34;]
  * module.hearings.azurerm_dns_a_record.this[&#34;px02.dev.self-test&#34;]
  * module.hearings.azurerm_dns_a_record.this[&#34;px02.preprod&#34;]
  * module.hearings.azurerm_dns_a_record.this[&#34;px02.preprod.self-test&#34;]
  * module.hearings.azurerm_dns_a_record.this[&#34;px02.self-test&#34;]
  * module.hearings.azurerm_dns_a_record.this[&#34;px02.test&#34;]
  * module.hearings.azurerm_dns_a_record.this[&#34;px02.test.self-test&#34;]
  * module.hearings.azurerm_dns_a_record.this[&#34;px02.test2&#34;]
  * module.hearings.azurerm_dns_a_record.this[&#34;px03&#34;]
  * module.hearings.azurerm_dns_a_record.this[&#34;px03.dev&#34;]
  * module.hearings.azurerm_dns_a_record.this[&#34;px03.dev.self-test&#34;]
  * module.hearings.azurerm_dns_a_record.this[&#34;px03.preprod&#34;]
  * module.hearings.azurerm_dns_a_record.this[&#34;px03.preprod.self-test&#34;]
  * module.hearings.azurerm_dns_a_record.this[&#34;px03.self-test&#34;]
  * module.hearings.azurerm_dns_a_record.this[&#34;px03.test&#34;]
  * module.hearings.azurerm_dns_a_record.this[&#34;px03.test.self-test&#34;]
  * module.hearings.azurerm_dns_a_record.this[&#34;px03.test2&#34;]
  * module.hearings.azurerm_dns_a_record.this[&#34;self-test&#34;]
  * module.hearings.azurerm_dns_a_record.this[&#34;sip&#34;]
  * module.hearings.azurerm_dns_a_record.this[&#34;sip.dev&#34;]
  * module.hearings.azurerm_dns_a_record.this[&#34;sip.dev.self-test&#34;]
  * module.hearings.azurerm_dns_a_record.this[&#34;sip.preprod&#34;]
  * module.hearings.azurerm_dns_a_record.this[&#34;sip.preprod.self-test&#34;]
  * module.hearings.azurerm_dns_a_record.this[&#34;sip.self-test&#34;]
  * module.hearings.azurerm_dns_a_record.this[&#34;sip.test&#34;]
  * module.hearings.azurerm_dns_a_record.this[&#34;sip.test.self-test&#34;]
  * module.hearings.azurerm_dns_a_record.this[&#34;sip.test2&#34;]
  * module.hearings.azurerm_dns_a_record.this[&#34;stream01.test&#34;]
  * module.hearings.azurerm_dns_a_record.this[&#34;stream01.test2&#34;]
  * module.hearings.azurerm_dns_a_record.this[&#34;stream02.test&#34;]
  * module.hearings.azurerm_dns_a_record.this[&#34;stream02.test2&#34;]
  * module.hearings.azurerm_dns_a_record.this[&#34;test&#34;]
  * module.hearings.azurerm_dns_a_record.this[&#34;test.self-test&#34;]
  * module.hearings.azurerm_dns_a_record.this[&#34;test2&#34;]
  * module.hearings.azurerm_dns_cname_record.this[&#34;_17D2C96CF5C0A9CDE42BF3A9F81716A5.test&#34;]
  * module.hearings.azurerm_dns_cname_record.this[&#34;_1853BCE2740C31E32578CE1F7FACB451.join.preprod&#34;]
  * module.hearings.azurerm_dns_cname_record.this[&#34;_1853BCE2740C31E32578CE1F7FACB451.preprod&#34;]
  * module.hearings.azurerm_dns_cname_record.this[&#34;_1FF91ACC5A477EAB2D470328902883E0.px01.dev.self-test&#34;]
  * module.hearings.azurerm_dns_cname_record.this[&#34;_1FF91ACC5A477EAB2D470328902883E0.px02.dev.self-test&#34;]
  * module.hearings.azurerm_dns_cname_record.this[&#34;_1FF91ACC5A477EAB2D470328902883E0.px03.dev.self-test&#34;]
  * module.hearings.azurerm_dns_cname_record.this[&#34;_1FF91ACC5A477EAB2D470328902883E0.sip.dev.self-test&#34;]
  * module.hearings.azurerm_dns_cname_record.this[&#34;_2A2691CE3B658B5944439E230CB331F7.test.self-test&#34;]
  * module.hearings.azurerm_dns_cname_record.this[&#34;_382A6339C9D57452479D75F11BE28824.px01.self-test&#34;]
  * module.hearings.azurerm_dns_cname_record.this[&#34;_382A6339C9D57452479D75F11BE28824.px02.self-test&#34;]
  * module.hearings.azurerm_dns_cname_record.this[&#34;_382A6339C9D57452479D75F11BE28824.px03.self-test&#34;]
  * module.hearings.azurerm_dns_cname_record.this[&#34;_382A6339C9D57452479D75F11BE28824.sip.self-test&#34;]
  * module.hearings.azurerm_dns_cname_record.this[&#34;_3F8E9CB06CCBEB447EDDA84235605832.test2&#34;]
  * module.hearings.azurerm_dns_cname_record.this[&#34;_48DEE43CE5391E4944658ED0A639DE03.sip.test&#34;]
  * module.hearings.azurerm_dns_cname_record.this[&#34;_58367157C5B84C146E7CCC64B7BF3043.px01.preprod.self-test&#34;]
  * module.hearings.azurerm_dns_cname_record.this[&#34;_58367157C5B84C146E7CCC64B7BF3043.px02.preprod.self-test&#34;]
  * module.hearings.azurerm_dns_cname_record.this[&#34;_58367157C5B84C146E7CCC64B7BF3043.px03.preprod.self-test&#34;]
  * module.hearings.azurerm_dns_cname_record.this[&#34;_58367157C5B84C146E7CCC64B7BF3043.sip.preprod.self-test&#34;]
  * module.hearings.azurerm_dns_cname_record.this[&#34;_5BC511AF7CA26EC7F7BE653BD22735A0.px01.preprod&#34;]
  * module.hearings.azurerm_dns_cname_record.this[&#34;_5BC511AF7CA26EC7F7BE653BD22735A0.px02.preprod&#34;]
  * module.hearings.azurerm_dns_cname_record.this[&#34;_5BC511AF7CA26EC7F7BE653BD22735A0.px03.preprod&#34;]
  * module.hearings.azurerm_dns_cname_record.this[&#34;_5BC511AF7CA26EC7F7BE653BD22735A0.sip.preprod&#34;]
  * module.hearings.azurerm_dns_cname_record.this[&#34;_6217DFE420A8C4424CC0EA0D341BD4E9.join.preprod.self-test&#34;]
  * module.hearings.azurerm_dns_cname_record.this[&#34;_6217DFE420A8C4424CC0EA0D341BD4E9.preprod.self-test&#34;]
  * module.hearings.azurerm_dns_cname_record.this[&#34;_83A73F75853CF72E7DECB65DFEA5278D&#34;]
  * module.hearings.azurerm_dns_cname_record.this[&#34;_83A73F75853CF72E7DECB65DFEA5278D.join&#34;]
  * module.hearings.azurerm_dns_cname_record.this[&#34;_83BF00A603FB7772285B7CD42719DE2B.px01&#34;]
  * module.hearings.azurerm_dns_cname_record.this[&#34;_83BF00A603FB7772285B7CD42719DE2B.px02&#34;]
  * module.hearings.azurerm_dns_cname_record.this[&#34;_83BF00A603FB7772285B7CD42719DE2B.px03&#34;]
  * module.hearings.azurerm_dns_cname_record.this[&#34;_83BF00A603FB7772285B7CD42719DE2B.sip&#34;]
  * module.hearings.azurerm_dns_cname_record.this[&#34;_9AE740C7ECCB56BE0F5A746B58789611.sip.test.self-test&#34;]
  * module.hearings.azurerm_dns_cname_record.this[&#34;_C05ABA6359AB3B9FFB305A57CC59EF81.dev&#34;]
  * module.hearings.azurerm_dns_cname_record.this[&#34;_C05ABA6359AB3B9FFB305A57CC59EF81.join.dev&#34;]
  * module.hearings.azurerm_dns_cname_record.this[&#34;_C4470C22E6152AB5F4E8384E44AECA63.sip.test2&#34;]
  * module.hearings.azurerm_dns_cname_record.this[&#34;_C9757D356239C241A772506CB7AE3FB1.px01.dev&#34;]
  * module.hearings.azurerm_dns_cname_record.this[&#34;_C9757D356239C241A772506CB7AE3FB1.px02.dev&#34;]
  * module.hearings.azurerm_dns_cname_record.this[&#34;_C9757D356239C241A772506CB7AE3FB1.px03.dev&#34;]
  * module.hearings.azurerm_dns_cname_record.this[&#34;_C9757D356239C241A772506CB7AE3FB1.sip.dev&#34;]
  * module.hearings.azurerm_dns_cname_record.this[&#34;_CE95CA8B4AAC0FD386520FA87ED64BB6.test.self-test&#34;]
  * module.hearings.azurerm_dns_cname_record.this[&#34;_D79AD523DFFB6B8CFEC81DF7120903DD.join.self-test&#34;]
  * module.hearings.azurerm_dns_cname_record.this[&#34;_D79AD523DFFB6B8CFEC81DF7120903DD.self-test&#34;]
  * module.hearings.azurerm_dns_cname_record.this[&#34;_DE900A421003C8C9009000815A5D8D92.dev.self-test&#34;]
  * module.hearings.azurerm_dns_cname_record.this[&#34;_F264A46BF910BB76E0AA11B752F253DE.stream.test&#34;]
  * module.hearings.azurerm_dns_cname_record.this[&#34;_F78198F0169C8B39122A711742D1904A.stream.test2&#34;]
  * module.hearings.azurerm_dns_ns_record.this[&#34;staging&#34;]
  * module.hearings.azurerm_dns_srv_record.this[&#34;_h323cs._tcp&#34;]
  * module.hearings.azurerm_dns_srv_record.this[&#34;_h323ls._udp&#34;]
  * module.hearings.azurerm_dns_srv_record.this[&#34;_h323rs._udp&#34;]
  * module.hearings.azurerm_dns_srv_record.this[&#34;_sip._tcp&#34;]
  * module.hearings.azurerm_dns_srv_record.this[&#34;_sip._tcp.preprod&#34;]
  * module.hearings.azurerm_dns_srv_record.this[&#34;_sip._tcp.test&#34;]
  * module.hearings.azurerm_dns_srv_record.this[&#34;_sipfederationtls._tcp&#34;]
  * module.hearings.azurerm_dns_srv_record.this[&#34;_sips._tcp&#34;]
  * module.hearings.azurerm_dns_srv_record.this[&#34;_sips._tcp.preprod&#34;]
  * module.hearings.azurerm_dns_srv_record.this[&#34;_sips._tcp.test&#34;]
  * module.hearings.azurerm_dns_zone.zone
  * module.hearings.azurerm_role_assignment.dnszonecontributer
  * module.hmcts-access.azurerm_dns_a_record.this[&#34;@&#34;]
  * module.hmcts-access.azurerm_dns_cname_record.this[&#34;afdverify&#34;]
  * module.hmcts-access.azurerm_dns_cname_record.this[&#34;cdnverify&#34;]
  * module.hmcts-access.azurerm_dns_zone.zone
  * module.hmcts-access.azurerm_role_assignment.dnszonecontributer
  * module.hmcts-webchat.azurerm_dns_zone.zone
  * module.hmcts-webchat.azurerm_role_assignment.dnszonecontributer
  * module.immigrationappealsonline.azurerm_dns_a_record.this[&#34;@&#34;]
  * module.immigrationappealsonline.azurerm_dns_cname_record.this[&#34;afdverify.dev&#34;]
  * module.immigrationappealsonline.azurerm_dns_cname_record.this[&#34;afdverify.staging&#34;]
  * module.immigrationappealsonline.azurerm_dns_cname_record.this[&#34;dev&#34;]
  * module.immigrationappealsonline.azurerm_dns_cname_record.this[&#34;staging&#34;]
  * module.immigrationappealsonline.azurerm_dns_zone.zone
  * module.immigrationappealsonline.azurerm_role_assignment.dnszonecontributer
  * module.jcm-judiciary.azurerm_dns_a_record.this[&#34;@&#34;]
  * module.jcm-judiciary.azurerm_dns_cname_record.this[&#34;_5ecfb849dc48eea11d818fd219b68bb1&#34;]
  * module.jcm-judiciary.azurerm_dns_cname_record.this[&#34;_5ecfb849dc48eea11d818fd219b68bb1.www&#34;]
  * module.jcm-judiciary.azurerm_dns_cname_record.this[&#34;cdnverify&#34;]
  * module.jcm-judiciary.azurerm_dns_cname_record.this[&#34;www&#34;]
  * module.jcm-judiciary.azurerm_dns_zone.zone
  * module.jcm-judiciary.azurerm_role_assignment.dnszonecontributer
  * module.juror-bureau.azurerm_dns_a_record.this[&#34;@&#34;]
  * module.juror-bureau.azurerm_dns_cname_record.this[&#34;afdverify&#34;]
  * module.juror-bureau.azurerm_dns_cname_record.this[&#34;cdnverify&#34;]
  * module.juror-bureau.azurerm_dns_zone.zone
  * module.juror-bureau.azurerm_role_assignment.dnszonecontributer
  * module.mailrelay-platform-hmcts.azurerm_dns_a_record.this[&#34;dev&#34;]
  * module.mailrelay-platform-hmcts.azurerm_dns_a_record.this[&#34;prod&#34;]
  * module.mailrelay-platform-hmcts.azurerm_dns_cname_record.this[&#34;_93C2F3E02CA882E3F4FD39F6EFA6F73F.dev-in&#34;]
  * module.mailrelay-platform-hmcts.azurerm_dns_cname_record.this[&#34;dev-in&#34;]
  * module.mailrelay-platform-hmcts.azurerm_dns_cname_record.this[&#34;prod-in&#34;]
  * module.mailrelay-platform-hmcts.azurerm_dns_txt_record.this[&#34;_dmarc.dev&#34;]
  * module.mailrelay-platform-hmcts.azurerm_dns_txt_record.this[&#34;_dmarc.dev-in&#34;]
  * module.mailrelay-platform-hmcts.azurerm_dns_txt_record.this[&#34;_dmarc.prod&#34;]
  * module.mailrelay-platform-hmcts.azurerm_dns_txt_record.this[&#34;_dmarc.prod-in&#34;]
  * module.mailrelay-platform-hmcts.azurerm_dns_txt_record.this[&#34;dev&#34;]
  * module.mailrelay-platform-hmcts.azurerm_dns_txt_record.this[&#34;prod&#34;]
  * module.mailrelay-platform-hmcts.azurerm_dns_zone.zone
  * module.mailrelay-platform-hmcts.azurerm_role_assignment.dnszonecontributer
  * module.mft-hmcts.azurerm_dns_cname_record.this[&#34;_88dbe07d793b449d310f7fa36a6446d9.baisexternal.ext&#34;]
  * module.mft-hmcts.azurerm_dns_cname_record.this[&#34;afdverify.baisweb-stg&#34;]
  * module.mft-hmcts.azurerm_dns_cname_record.this[&#34;baisexternal.ext&#34;]
  * module.mft-hmcts.azurerm_dns_cname_record.this[&#34;baisweb&#34;]
  * module.mft-hmcts.azurerm_dns_cname_record.this[&#34;baisweb-stg&#34;]
  * module.mft-hmcts.azurerm_dns_cname_record.this[&#34;erupload.ext&#34;]
  * module.mft-hmcts.azurerm_dns_cname_record.this[&#34;eruploadSTG.ext&#34;]
  * module.mft-hmcts.azurerm_dns_cname_record.this[&#34;www.baisweb&#34;]
  * module.mft-hmcts.azurerm_dns_cname_record.this[&#34;www.baisweb-stg&#34;]
  * module.mft-hmcts.azurerm_dns_cname_record.this[&#34;www.erupload.ext&#34;]
  * module.mft-hmcts.azurerm_dns_cname_record.this[&#34;www.eruploadSTG.ext&#34;]
  * module.mft-hmcts.azurerm_dns_zone.zone
  * module.mft-hmcts.azurerm_role_assignment.dnszonecontributer
  * module.moneyclaims.azurerm_dns_cname_record.this[&#34;afdverify.www&#34;]
  * module.moneyclaims.azurerm_dns_cname_record.this[&#34;cdnverify.www&#34;]
  * module.moneyclaims.azurerm_dns_cname_record.this[&#34;em714.mail&#34;]
  * module.moneyclaims.azurerm_dns_cname_record.this[&#34;s1._domainkey.mail&#34;]
  * module.moneyclaims.azurerm_dns_cname_record.this[&#34;s2._domainkey.mail&#34;]
  * module.moneyclaims.azurerm_dns_cname_record.this[&#34;www&#34;]
  * module.moneyclaims.azurerm_dns_zone.zone
  * module.moneyclaims.azurerm_role_assignment.dnszonecontributer
  * module.pip-court-tribunal-hearings.azurerm_dns_cname_record.this[&#34;afdverify.www&#34;]
  * module.pip-court-tribunal-hearings.azurerm_dns_cname_record.this[&#34;cdnverify.www&#34;]
  * module.pip-court-tribunal-hearings.azurerm_dns_cname_record.this[&#34;login&#34;]
  * module.pip-court-tribunal-hearings.azurerm_dns_cname_record.this[&#34;sign-in&#34;]
  * module.pip-court-tribunal-hearings.azurerm_dns_cname_record.this[&#34;staff&#34;]
  * module.pip-court-tribunal-hearings.azurerm_dns_cname_record.this[&#34;www&#34;]
  * module.pip-court-tribunal-hearings.azurerm_dns_txt_record.this[&#34;@&#34;]
  * module.pip-court-tribunal-hearings.azurerm_dns_zone.zone
  * module.pip-court-tribunal-hearings.azurerm_role_assignment.dnszonecontributer
  * module.platform-hmcts.azurerm_dns_a_record.this[&#34;backstage&#34;]
  * module.platform-hmcts.azurerm_dns_a_record.this[&#34;bar&#34;]
  * module.platform-hmcts.azurerm_dns_a_record.this[&#34;build&#34;]
  * module.platform-hmcts.azurerm_dns_a_record.this[&#34;build-beta&#34;]
  * module.platform-hmcts.azurerm_dns_a_record.this[&#34;caps&#34;]
  * module.platform-hmcts.azurerm_dns_a_record.this[&#34;courts&#34;]
  * module.platform-hmcts.azurerm_dns_a_record.this[&#34;cp-nle&#34;]
  * module.platform-hmcts.azurerm_dns_a_record.this[&#34;ctsc-web-forms-ui-stg&#34;]
  * module.platform-hmcts.azurerm_dns_a_record.this[&#34;cvp-recording&#34;]
  * module.platform-hmcts.azurerm_dns_a_record.this[&#34;divorce-palo-prod&#34;]
  * module.platform-hmcts.azurerm_dns_a_record.this[&#34;maintenance-ccd&#34;]
  * module.platform-hmcts.azurerm_dns_a_record.this[&#34;pcnotify&#34;]
  * module.platform-hmcts.azurerm_dns_a_record.this[&#34;pcol&#34;]
  * module.platform-hmcts.azurerm_dns_a_record.this[&#34;portal&#34;]
  * module.platform-hmcts.azurerm_dns_a_record.this[&#34;response&#34;]
  * module.platform-hmcts.azurerm_dns_a_record.this[&#34;sandbox-build&#34;]
  * module.platform-hmcts.azurerm_dns_a_record.this[&#34;sandbox-build-beta&#34;]
  * module.platform-hmcts.azurerm_dns_a_record.this[&#34;sds-build&#34;]
  * module.platform-hmcts.azurerm_dns_a_record.this[&#34;sds-sandbox-build&#34;]
  * module.platform-hmcts.azurerm_dns_a_record.this[&#34;sftp&#34;]
  * module.platform-hmcts.azurerm_dns_a_record.this[&#34;sod-ss&#34;]
  * module.platform-hmcts.azurerm_dns_a_record.this[&#34;static-build&#34;]
  * module.platform-hmcts.azurerm_dns_a_record.this[&#34;static-sandbox-build&#34;]
  * module.platform-hmcts.azurerm_dns_a_record.this[&#34;static-sds-build&#34;]
  * module.platform-hmcts.azurerm_dns_a_record.this[&#34;static-sds-sandbox-build&#34;]
  * module.platform-hmcts.azurerm_dns_a_record.this[&#34;traefik-sod-ss&#34;]
  * module.platform-hmcts.azurerm_dns_a_record.this[&#34;traefik-stg&#34;]
  * module.platform-hmcts.azurerm_dns_a_record.this[&#34;traefik-ui-jb&#34;]
  * module.platform-hmcts.azurerm_dns_a_record.this[&#34;vh-wowza-public&#34;]
  * module.platform-hmcts.azurerm_dns_a_record.this[&#34;vpn&#34;]
  * module.platform-hmcts.azurerm_dns_a_record.this[&#34;vpn-ext&#34;]
  * module.platform-hmcts.azurerm_dns_cname_record.this[&#34;_0be35efd23b00eb9f75301c49805b99a.vh-user-api&#34;]
  * module.platform-hmcts.azurerm_dns_cname_record.this[&#34;_250e8aa720222655812148349eda33fd.service&#34;]
  * module.platform-hmcts.azurerm_dns_cname_record.this[&#34;_57FB5B9CD7C93A5B9C28ACA5C634ECDF.splunk&#34;]
  * module.platform-hmcts.azurerm_dns_cname_record.this[&#34;_57FB5B9CD7C93A5B9C28ACA5C634ECDF.splunk-cm-prod-vm00&#34;]
  * module.platform-hmcts.azurerm_dns_cname_record.this[&#34;_57FB5B9CD7C93A5B9C28ACA5C634ECDF.splunk-es-prod-vm00&#34;]
  * module.platform-hmcts.azurerm_dns_cname_record.this[&#34;_57FB5B9CD7C93A5B9C28ACA5C634ECDF.splunk-es-prod-vm01&#34;]
  * module.platform-hmcts.azurerm_dns_cname_record.this[&#34;_57FB5B9CD7C93A5B9C28ACA5C634ECDF.splunk-hfwd-prod-vm00&#34;]
  * module.platform-hmcts.azurerm_dns_cname_record.this[&#34;_57FB5B9CD7C93A5B9C28ACA5C634ECDF.splunk-hfwd-prod-vm01&#34;]
  * module.platform-hmcts.azurerm_dns_cname_record.this[&#34;_57FB5B9CD7C93A5B9C28ACA5C634ECDF.splunk-hfwd-prod-vm02&#34;]
  * module.platform-hmcts.azurerm_dns_cname_record.this[&#34;_57FB5B9CD7C93A5B9C28ACA5C634ECDF.splunk-idx-prod-vm00&#34;]
  * module.platform-hmcts.azurerm_dns_cname_record.this[&#34;_57FB5B9CD7C93A5B9C28ACA5C634ECDF.splunk-idx-prod-vm01&#34;]
  * module.platform-hmcts.azurerm_dns_cname_record.this[&#34;_57FB5B9CD7C93A5B9C28ACA5C634ECDF.splunk-idx-prod-vm02&#34;]
  * module.platform-hmcts.azurerm_dns_cname_record.this[&#34;_57FB5B9CD7C93A5B9C28ACA5C634ECDF.splunk-idx-prod-vm03&#34;]
  * module.platform-hmcts.azurerm_dns_cname_record.this[&#34;_57FB5B9CD7C93A5B9C28ACA5C634ECDF.splunk-idx-prod-vm04&#34;]
  * module.platform-hmcts.azurerm_dns_cname_record.this[&#34;_57FB5B9CD7C93A5B9C28ACA5C634ECDF.splunk-idx-prod-vm05&#34;]
  * module.platform-hmcts.azurerm_dns_cname_record.this[&#34;_57FB5B9CD7C93A5B9C28ACA5C634ECDF.splunk-idx-prod-vm06&#34;]
  * module.platform-hmcts.azurerm_dns_cname_record.this[&#34;_57FB5B9CD7C93A5B9C28ACA5C634ECDF.splunk-idx-prod-vm07&#34;]
  * module.platform-hmcts.azurerm_dns_cname_record.this[&#34;_57FB5B9CD7C93A5B9C28ACA5C634ECDF.splunk-lm-prod-vm00&#34;]
  * module.platform-hmcts.azurerm_dns_cname_record.this[&#34;_57FB5B9CD7C93A5B9C28ACA5C634ECDF.splunk-mc-prod-vm00&#34;]
  * module.platform-hmcts.azurerm_dns_cname_record.this[&#34;_57FB5B9CD7C93A5B9C28ACA5C634ECDF.splunk-sh-prod-vm00&#34;]
  * module.platform-hmcts.azurerm_dns_cname_record.this[&#34;_5c7ef33bcb57182a54f2d9cc8d8ac0f8.vh-bookings-api&#34;]
  * module.platform-hmcts.azurerm_dns_cname_record.this[&#34;_959babd6a885261723d801a16c89a7b1.vh-notification-api&#34;]
  * module.platform-hmcts.azurerm_dns_cname_record.this[&#34;_DEFCA9944606874FF3B5E0E653FF9825&#34;]
  * module.platform-hmcts.azurerm_dns_cname_record.this[&#34;_ac285a78514b19d657b18c29b98f4c7f.admin&#34;]
  * module.platform-hmcts.azurerm_dns_cname_record.this[&#34;_df529a77950081e3ad8c21586162089b.video&#34;]
  * module.platform-hmcts.azurerm_dns_cname_record.this[&#34;administer-orgs&#34;]
  * module.platform-hmcts.azurerm_dns_cname_record.this[&#34;administer-orgs-ethosldata&#34;]
  * module.platform-hmcts.azurerm_dns_cname_record.this[&#34;afdverify.administer-orgs&#34;]
  * module.platform-hmcts.azurerm_dns_cname_record.this[&#34;afdverify.apply-for-adoption&#34;]
  * module.platform-hmcts.azurerm_dns_cname_record.this[&#34;afdverify.c100-application&#34;]
  * module.platform-hmcts.azurerm_dns_cname_record.this[&#34;afdverify.cft-api-mgmt&#34;]
  * module.platform-hmcts.azurerm_dns_cname_record.this[&#34;afdverify.equality-and-diversity&#34;]
  * module.platform-hmcts.azurerm_dns_cname_record.this[&#34;afdverify.fees-register&#34;]
  * module.platform-hmcts.azurerm_dns_cname_record.this[&#34;afdverify.gateway.ccd&#34;]
  * module.platform-hmcts.azurerm_dns_cname_record.this[&#34;afdverify.hmi-apim&#34;]
  * module.platform-hmcts.azurerm_dns_cname_record.this[&#34;afdverify.idam-user-dashboard&#34;]
  * module.platform-hmcts.azurerm_dns_cname_record.this[&#34;afdverify.idam-web-admin&#34;]
  * module.platform-hmcts.azurerm_dns_cname_record.this[&#34;afdverify.immigration-appeal&#34;]
  * module.platform-hmcts.azurerm_dns_cname_record.this[&#34;afdverify.log-and-audit&#34;]
  * module.platform-hmcts.azurerm_dns_cname_record.this[&#34;afdverify.manage-case&#34;]
  * module.platform-hmcts.azurerm_dns_cname_record.this[&#34;afdverify.manage-org&#34;]
  * module.platform-hmcts.azurerm_dns_cname_record.this[&#34;afdverify.manage-payments&#34;]
  * module.platform-hmcts.azurerm_dns_cname_record.this[&#34;afdverify.paybubble&#34;]
  * module.platform-hmcts.azurerm_dns_cname_record.this[&#34;afdverify.plum&#34;]
  * module.platform-hmcts.azurerm_dns_cname_record.this[&#34;afdverify.reformscan&#34;]
  * module.platform-hmcts.azurerm_dns_cname_record.this[&#34;afdverify.register-org&#34;]
  * module.platform-hmcts.azurerm_dns_cname_record.this[&#34;afdverify.return-case-doc.ccd&#34;]
  * module.platform-hmcts.azurerm_dns_cname_record.this[&#34;afdverify.sds-api-mgmt&#34;]
  * module.platform-hmcts.azurerm_dns_cname_record.this[&#34;afdverify.toffee&#34;]
  * module.platform-hmcts.azurerm_dns_cname_record.this[&#34;afdverify.vh-admin-web&#34;]
  * module.platform-hmcts.azurerm_dns_cname_record.this[&#34;afdverify.vh-test-web&#34;]
  * module.platform-hmcts.azurerm_dns_cname_record.this[&#34;afdverify.vh-video-web&#34;]
  * module.platform-hmcts.azurerm_dns_cname_record.this[&#34;afdverify.vh-wowza&#34;]
  * module.platform-hmcts.azurerm_dns_cname_record.this[&#34;afdverify.www.fees-register&#34;]
  * module.platform-hmcts.azurerm_dns_cname_record.this[&#34;afdverify.www.manage-payments&#34;]
  * module.platform-hmcts.azurerm_dns_cname_record.this[&#34;afdverify.www.moneyclaim-legal&#34;]
  * module.platform-hmcts.azurerm_dns_cname_record.this[&#34;afdverify.www.paybubble&#34;]
  * module.platform-hmcts.azurerm_dns_cname_record.this[&#34;apply-divorce&#34;]
  * module.platform-hmcts.azurerm_dns_cname_record.this[&#34;apply-for-adoption&#34;]
  * module.platform-hmcts.azurerm_dns_cname_record.this[&#34;asverify.probate&#34;]
  * module.platform-hmcts.azurerm_dns_cname_record.this[&#34;asverify.reformscan&#34;]
  * module.platform-hmcts.azurerm_dns_cname_record.this[&#34;asverify.reformscanstg&#34;]
  * module.platform-hmcts.azurerm_dns_cname_record.this[&#34;awverify.probate&#34;]
  * module.platform-hmcts.azurerm_dns_cname_record.this[&#34;awverify.probate.aat&#34;]
  * module.platform-hmcts.azurerm_dns_cname_record.this[&#34;awverify.probate.saat&#34;]
  * module.platform-hmcts.azurerm_dns_cname_record.this[&#34;benefit-appeal&#34;]
  * module.platform-hmcts.azurerm_dns_cname_record.this[&#34;c100-application&#34;]
  * module.platform-hmcts.azurerm_dns_cname_record.this[&#34;cdnverify.administer-orgs&#34;]
  * module.platform-hmcts.azurerm_dns_cname_record.this[&#34;cdnverify.apply-for-adoption&#34;]
  * module.platform-hmcts.azurerm_dns_cname_record.this[&#34;cdnverify.c100-application&#34;]
  * module.platform-hmcts.azurerm_dns_cname_record.this[&#34;cdnverify.equality-and-diversity&#34;]
  * module.platform-hmcts.azurerm_dns_cname_record.this[&#34;cdnverify.fees-register&#34;]
  * module.platform-hmcts.azurerm_dns_cname_record.this[&#34;cdnverify.gateway.ccd&#34;]
  * module.platform-hmcts.azurerm_dns_cname_record.this[&#34;cdnverify.hmi-apim&#34;]
  * module.platform-hmcts.azurerm_dns_cname_record.this[&#34;cdnverify.idam-user-dashboard&#34;]
  * module.platform-hmcts.azurerm_dns_cname_record.this[&#34;cdnverify.idam-web-admin&#34;]
  * module.platform-hmcts.azurerm_dns_cname_record.this[&#34;cdnverify.log-and-audit&#34;]
  * module.platform-hmcts.azurerm_dns_cname_record.this[&#34;cdnverify.manage-case&#34;]
  * module.platform-hmcts.azurerm_dns_cname_record.this[&#34;cdnverify.manage-org&#34;]
  * module.platform-hmcts.azurerm_dns_cname_record.this[&#34;cdnverify.manage-payments&#34;]
  * module.platform-hmcts.azurerm_dns_cname_record.this[&#34;cdnverify.paybubble&#34;]
  * module.platform-hmcts.azurerm_dns_cname_record.this[&#34;cdnverify.paymentoutcome-web&#34;]
  * module.platform-hmcts.azurerm_dns_cname_record.this[&#34;cdnverify.plum&#34;]
  * module.platform-hmcts.azurerm_dns_cname_record.this[&#34;cdnverify.reformscan&#34;]
  * module.platform-hmcts.azurerm_dns_cname_record.this[&#34;cdnverify.register-org&#34;]
  * module.platform-hmcts.azurerm_dns_cname_record.this[&#34;cdnverify.return-case-doc.ccd&#34;]
  * module.platform-hmcts.azurerm_dns_cname_record.this[&#34;cdnverify.sds-api-mgmt&#34;]
  * module.platform-hmcts.azurerm_dns_cname_record.this[&#34;cdnverify.vh-admin-web&#34;]
  * module.platform-hmcts.azurerm_dns_cname_record.this[&#34;cdnverify.vh-test-web&#34;]
  * module.platform-hmcts.azurerm_dns_cname_record.this[&#34;cdnverify.vh-video-web&#34;]
  * module.platform-hmcts.azurerm_dns_cname_record.this[&#34;cdnverify.www.moneyclaim-legal&#34;]
  * module.platform-hmcts.azurerm_dns_cname_record.this[&#34;cft-api-mgmt&#34;]
  * module.platform-hmcts.azurerm_dns_cname_record.this[&#34;cman&#34;]
  * module.platform-hmcts.azurerm_dns_cname_record.this[&#34;divorce.nonprod&#34;]
  * module.platform-hmcts.azurerm_dns_cname_record.this[&#34;em11.mail-sscs-nonprod&#34;]
  * module.platform-hmcts.azurerm_dns_cname_record.this[&#34;em2301.mail-money-claims-nonprod&#34;]
  * module.platform-hmcts.azurerm_dns_cname_record.this[&#34;em2631.mail-am&#34;]
  * module.platform-hmcts.azurerm_dns_cname_record.this[&#34;em2983.mail-db-reporting-prod&#34;]
  * module.platform-hmcts.azurerm_dns_cname_record.this[&#34;em3038.mail-rd&#34;]
  * module.platform-hmcts.azurerm_dns_cname_record.this[&#34;em5088.mail-civil-prod.platform.hmcts.net&#34;]
  * module.platform-hmcts.azurerm_dns_cname_record.this[&#34;em5255.mail-rd-nonprod&#34;]
  * module.platform-hmcts.azurerm_dns_cname_record.this[&#34;em5261.mail-payment-nonprod&#34;]
  * module.platform-hmcts.azurerm_dns_cname_record.this[&#34;em5901.mail-prl&#34;]
  * module.platform-hmcts.azurerm_dns_cname_record.this[&#34;em6661.mail-divorce-nonprod&#34;]
  * module.platform-hmcts.azurerm_dns_cname_record.this[&#34;em8228.mail-sscs&#34;]
  * module.platform-hmcts.azurerm_dns_cname_record.this[&#34;em8309.mail-payment&#34;]
  * module.platform-hmcts.azurerm_dns_cname_record.this[&#34;em8346.mail-divorce&#34;]
  * module.platform-hmcts.azurerm_dns_cname_record.this[&#34;em8468.mail-am-nonprod&#34;]
  * module.platform-hmcts.azurerm_dns_cname_record.this[&#34;em9503.mail-damages-nonprod&#34;]
  * module.platform-hmcts.azurerm_dns_cname_record.this[&#34;equality-and-diversity&#34;]
  * module.platform-hmcts.azurerm_dns_cname_record.this[&#34;fees-register&#34;]
  * module.platform-hmcts.azurerm_dns_cname_record.this[&#34;gateway.ccd&#34;]
  * module.platform-hmcts.azurerm_dns_cname_record.this[&#34;hmi-apim&#34;]
  * module.platform-hmcts.azurerm_dns_cname_record.this[&#34;idam-user-dashboard&#34;]
  * module.platform-hmcts.azurerm_dns_cname_record.this[&#34;idam-web-admin&#34;]
  * module.platform-hmcts.azurerm_dns_cname_record.this[&#34;idam-web-public-ethosldata&#34;]
  * module.platform-hmcts.azurerm_dns_cname_record.this[&#34;immigration-appeal&#34;]
  * module.platform-hmcts.azurerm_dns_cname_record.this[&#34;jlfsrhi3m76w&#34;]
  * module.platform-hmcts.azurerm_dns_cname_record.this[&#34;log-and-audit&#34;]
  * module.platform-hmcts.azurerm_dns_cname_record.this[&#34;maintenance.moneyclaim-legal.nonprod&#34;]
  * module.platform-hmcts.azurerm_dns_cname_record.this[&#34;maintenance.nonprod&#34;]
  * module.platform-hmcts.azurerm_dns_cname_record.this[&#34;manage-case&#34;]
  * module.platform-hmcts.azurerm_dns_cname_record.this[&#34;manage-case-ethosldata&#34;]
  * module.platform-hmcts.azurerm_dns_cname_record.this[&#34;manage-org&#34;]
  * module.platform-hmcts.azurerm_dns_cname_record.this[&#34;manage-org-ethosldata&#34;]
  * module.platform-hmcts.azurerm_dns_cname_record.this[&#34;manage-payments&#34;]
  * module.platform-hmcts.azurerm_dns_cname_record.this[&#34;mcnotify&#34;]
  * module.platform-hmcts.azurerm_dns_cname_record.this[&#34;mcol&#34;]
  * module.platform-hmcts.azurerm_dns_cname_record.this[&#34;moneyclaim-legal.nonprod&#34;]
  * module.platform-hmcts.azurerm_dns_cname_record.this[&#34;paybubble&#34;]
  * module.platform-hmcts.azurerm_dns_cname_record.this[&#34;paymentoutcome-web&#34;]
  * module.platform-hmcts.azurerm_dns_cname_record.this[&#34;plum&#34;]
  * module.platform-hmcts.azurerm_dns_cname_record.this[&#34;probate&#34;]
  * module.platform-hmcts.azurerm_dns_cname_record.this[&#34;probate.saat&#34;]
  * module.platform-hmcts.azurerm_dns_cname_record.this[&#34;reformscan&#34;]
  * module.platform-hmcts.azurerm_dns_cname_record.this[&#34;reformscanstg&#34;]
  * module.platform-hmcts.azurerm_dns_cname_record.this[&#34;register-org&#34;]
  * module.platform-hmcts.azurerm_dns_cname_record.this[&#34;return-case-doc.ccd&#34;]
  * module.platform-hmcts.azurerm_dns_cname_record.this[&#34;s1._domainkey.mail-am&#34;]
  * module.platform-hmcts.azurerm_dns_cname_record.this[&#34;s1._domainkey.mail-am-nonprod&#34;]
  * module.platform-hmcts.azurerm_dns_cname_record.this[&#34;s1._domainkey.mail-civil-prod.platform.hmcts.net&#34;]
  * module.platform-hmcts.azurerm_dns_cname_record.this[&#34;s1._domainkey.mail-damages-nonprod&#34;]
  * module.platform-hmcts.azurerm_dns_cname_record.this[&#34;s1._domainkey.mail-db-reporting-prod&#34;]
  * module.platform-hmcts.azurerm_dns_cname_record.this[&#34;s1._domainkey.mail-divorce&#34;]
  * module.platform-hmcts.azurerm_dns_cname_record.this[&#34;s1._domainkey.mail-divorce-nonprod&#34;]
  * module.platform-hmcts.azurerm_dns_cname_record.this[&#34;s1._domainkey.mail-money-claims-nonprod&#34;]
  * module.platform-hmcts.azurerm_dns_cname_record.this[&#34;s1._domainkey.mail-payment&#34;]
  * module.platform-hmcts.azurerm_dns_cname_record.this[&#34;s1._domainkey.mail-payment-nonprod&#34;]
  * module.platform-hmcts.azurerm_dns_cname_record.this[&#34;s1._domainkey.mail-prl&#34;]
  * module.platform-hmcts.azurerm_dns_cname_record.this[&#34;s1._domainkey.mail-rd&#34;]
  * module.platform-hmcts.azurerm_dns_cname_record.this[&#34;s1._domainkey.mail-rd-nonprod&#34;]
  * module.platform-hmcts.azurerm_dns_cname_record.this[&#34;s1._domainkey.mail-sscs&#34;]
  * module.platform-hmcts.azurerm_dns_cname_record.this[&#34;s1._domainkey.mail-sscs-nonprod&#34;]
  * module.platform-hmcts.azurerm_dns_cname_record.this[&#34;s2._domainkey.mail-am&#34;]
  * module.platform-hmcts.azurerm_dns_cname_record.this[&#34;s2._domainkey.mail-am-nonprod&#34;]
  * module.platform-hmcts.azurerm_dns_cname_record.this[&#34;s2._domainkey.mail-civil-prod.platform.hmcts.net&#34;]
  * module.platform-hmcts.azurerm_dns_cname_record.this[&#34;s2._domainkey.mail-damages-nonprod&#34;]
  * module.platform-hmcts.azurerm_dns_cname_record.this[&#34;s2._domainkey.mail-db-reporting-prod&#34;]
  * module.platform-hmcts.azurerm_dns_cname_record.this[&#34;s2._domainkey.mail-divorce&#34;]
  * module.platform-hmcts.azurerm_dns_cname_record.this[&#34;s2._domainkey.mail-divorce-nonprod&#34;]
  * module.platform-hmcts.azurerm_dns_cname_record.this[&#34;s2._domainkey.mail-money-claims-nonprod&#34;]
  * module.platform-hmcts.azurerm_dns_cname_record.this[&#34;s2._domainkey.mail-payment&#34;]
  * module.platform-hmcts.azurerm_dns_cname_record.this[&#34;s2._domainkey.mail-payment-nonprod&#34;]
  * module.platform-hmcts.azurerm_dns_cname_record.this[&#34;s2._domainkey.mail-prl&#34;]
  * module.platform-hmcts.azurerm_dns_cname_record.this[&#34;s2._domainkey.mail-rd&#34;]
  * module.platform-hmcts.azurerm_dns_cname_record.this[&#34;s2._domainkey.mail-rd-nonprod&#34;]
  * module.platform-hmcts.azurerm_dns_cname_record.this[&#34;s2._domainkey.mail-sscs&#34;]
  * module.platform-hmcts.azurerm_dns_cname_record.this[&#34;s2._domainkey.mail-sscs-nonprod&#34;]
  * module.platform-hmcts.azurerm_dns_cname_record.this[&#34;sds-api-mgmt&#34;]
  * module.platform-hmcts.azurerm_dns_cname_record.this[&#34;toffee&#34;]
  * module.platform-hmcts.azurerm_dns_cname_record.this[&#34;vh-admin-web&#34;]
  * module.platform-hmcts.azurerm_dns_cname_record.this[&#34;vh-test-web&#34;]
  * module.platform-hmcts.azurerm_dns_cname_record.this[&#34;vh-video-web&#34;]
  * module.platform-hmcts.azurerm_dns_cname_record.this[&#34;www.apply-divorce&#34;]
  * module.platform-hmcts.azurerm_dns_cname_record.this[&#34;www.fees-register&#34;]
  * module.platform-hmcts.azurerm_dns_cname_record.this[&#34;www.manage-payments&#34;]
  * module.platform-hmcts.azurerm_dns_cname_record.this[&#34;www.moneyclaim&#34;]
  * module.platform-hmcts.azurerm_dns_cname_record.this[&#34;www.moneyclaim-legal&#34;]
  * module.platform-hmcts.azurerm_dns_cname_record.this[&#34;www.paybubble&#34;]
  * module.platform-hmcts.azurerm_dns_cname_record.this[&#34;www.paymentoutcome-web&#34;]
  * module.platform-hmcts.azurerm_dns_mx_record.this[&#34;@&#34;]
  * module.platform-hmcts.azurerm_dns_ns_record.this[&#34;aat&#34;]
  * module.platform-hmcts.azurerm_dns_ns_record.this[&#34;demo&#34;]
  * module.platform-hmcts.azurerm_dns_ns_record.this[&#34;dev&#34;]
  * module.platform-hmcts.azurerm_dns_ns_record.this[&#34;hmctsdemo&#34;]
  * module.platform-hmcts.azurerm_dns_ns_record.this[&#34;ithc&#34;]
  * module.platform-hmcts.azurerm_dns_ns_record.this[&#34;mailrelay&#34;]
  * module.platform-hmcts.azurerm_dns_ns_record.this[&#34;nle&#34;]
  * module.platform-hmcts.azurerm_dns_ns_record.this[&#34;perftest&#34;]
  * module.platform-hmcts.azurerm_dns_ns_record.this[&#34;preview&#34;]
  * module.platform-hmcts.azurerm_dns_ns_record.this[&#34;prod&#34;]
  * module.platform-hmcts.azurerm_dns_ns_record.this[&#34;saat&#34;]
  * module.platform-hmcts.azurerm_dns_ns_record.this[&#34;sandbox&#34;]
  * module.platform-hmcts.azurerm_dns_ns_record.this[&#34;spreview&#34;]
  * module.platform-hmcts.azurerm_dns_ns_record.this[&#34;sprod&#34;]
  * module.platform-hmcts.azurerm_dns_ns_record.this[&#34;staging&#34;]
  * module.platform-hmcts.azurerm_dns_ns_record.this[&#34;test&#34;]
  * module.platform-hmcts.azurerm_dns_txt_record.this[&#34;@&#34;]
  * module.platform-hmcts.azurerm_dns_txt_record.this[&#34;_dmarc&#34;]
  * module.platform-hmcts.azurerm_dns_zone.zone
  * module.platform-hmcts.azurerm_role_assignment.dnszonecontributer
  * module.pre-recorded-evidence-justice.azurerm_dns_cname_record.this[&#34;_18FBACA52BAEA05806CA7012CA715BB2.portal&#34;]
  * module.pre-recorded-evidence-justice.azurerm_dns_cname_record.this[&#34;portal&#34;]
  * module.pre-recorded-evidence-justice.azurerm_dns_cname_record.this[&#34;portal-demo&#34;]
  * module.pre-recorded-evidence-justice.azurerm_dns_cname_record.this[&#34;portal-sbox&#34;]
  * module.pre-recorded-evidence-justice.azurerm_dns_cname_record.this[&#34;portal-stg&#34;]
  * module.pre-recorded-evidence-justice.azurerm_dns_cname_record.this[&#34;portal-test&#34;]
  * module.pre-recorded-evidence-justice.azurerm_dns_zone.zone
  * module.pre-recorded-evidence-justice.azurerm_role_assignment.dnszonecontributer
  * module.probatesearch.azurerm_dns_zone.zone
  * module.probatesearch.azurerm_role_assignment.dnszonecontributer
  * module.prod-hmcts-net.azurerm_dns_a_record.this[&#34;caps.db&#34;]
  * module.prod-hmcts-net.azurerm_dns_a_record.this[&#34;pcol.db&#34;]
  * module.prod-hmcts-net.azurerm_dns_zone.zone
  * module.prod-hmcts-net.azurerm_role_assignment.dnszonecontributer
  * module.prod-platform.azurerm_dns_cname_record.this[&#34;_0be35efd23b00eb9f75301c49805b99a.vh-user-api&#34;]
  * module.prod-platform.azurerm_dns_cname_record.this[&#34;_250e8aa720222655812148349eda33fd.vh-service-web&#34;]
  * module.prod-platform.azurerm_dns_cname_record.this[&#34;_5c7ef33bcb57182a54f2d9cc8d8ac0f8.vh-bookings-api&#34;]
  * module.prod-platform.azurerm_dns_cname_record.this[&#34;_959babd6a885261723d801a16c89a7b1.vh-notification-api&#34;]
  * module.prod-platform.azurerm_dns_cname_record.this[&#34;_ac285a78514b19d657b18c29b98f4c7f.vh-admin-web&#34;]
  * module.prod-platform.azurerm_dns_cname_record.this[&#34;_df529a77950081e3ad8c21586162089b.vh-video-web&#34;]
  * module.prod-platform.azurerm_dns_cname_record.this[&#34;afdverify.hmi-apim&#34;]
  * module.prod-platform.azurerm_dns_zone.zone
  * module.prod-platform.azurerm_role_assignment.dnszonecontributer
  * module.reform-hmcts.azurerm_dns_a_record.this[&#34;mail&#34;]
  * module.reform-hmcts.azurerm_dns_a_record.this[&#34;sftp-dev&#34;]
  * module.reform-hmcts.azurerm_dns_a_record.this[&#34;sftp-prod&#34;]
  * module.reform-hmcts.azurerm_dns_cname_record.this[&#34;em8472&#34;]
  * module.reform-hmcts.azurerm_dns_cname_record.this[&#34;em9657&#34;]
  * module.reform-hmcts.azurerm_dns_cname_record.this[&#34;s1._domainkey&#34;]
  * module.reform-hmcts.azurerm_dns_cname_record.this[&#34;s2._domainkey&#34;]
  * module.reform-hmcts.azurerm_dns_ns_record.this[&#34;hearings&#34;]
  * module.reform-hmcts.azurerm_dns_ns_record.this[&#34;ncp&#34;]
  * module.reform-hmcts.azurerm_dns_zone.zone
  * module.reform-hmcts.azurerm_role_assignment.dnszonecontributer
  * module.reply-jury-summons.azurerm_dns_a_record.this[&#34;@&#34;]
  * module.reply-jury-summons.azurerm_dns_cname_record.this[&#34;afdverify&#34;]
  * module.reply-jury-summons.azurerm_dns_cname_record.this[&#34;cdnverify&#34;]
  * module.reply-jury-summons.azurerm_dns_zone.zone
  * module.reply-jury-summons.azurerm_role_assignment.dnszonecontributer
  * module.residential-property-tribunals.azurerm_dns_cname_record.this[&#34;afdverify.www&#34;]
  * module.residential-property-tribunals.azurerm_dns_cname_record.this[&#34;cdnverify.www&#34;]
  * module.residential-property-tribunals.azurerm_dns_cname_record.this[&#34;www&#34;]
  * module.residential-property-tribunals.azurerm_dns_zone.zone
  * module.residential-property-tribunals.azurerm_role_assignment.dnszonecontributer
  * module.respond-divorce.azurerm_dns_cname_record.this[&#34;afdverify.www&#34;]
  * module.respond-divorce.azurerm_dns_cname_record.this[&#34;cdnverify.www&#34;]
  * module.respond-divorce.azurerm_dns_cname_record.this[&#34;www&#34;]
  * module.respond-divorce.azurerm_dns_zone.zone
  * module.respond-divorce.azurerm_role_assignment.dnszonecontributer
  * module.sftp-hmcts.azurerm_dns_cname_record.this[&#34;_AA8EC07175CE288A9960578BF8864075.bais-ext&#34;]
  * module.sftp-hmcts.azurerm_dns_cname_record.this[&#34;_D724A636D0EE8CF0CE02188391A736F7.bais-ext-stg&#34;]
  * module.sftp-hmcts.azurerm_dns_zone.zone
  * module.sftp-hmcts.azurerm_role_assignment.dnszonecontributer
  * module.track-benefit-appeal.azurerm_dns_cname_record.this[&#34;afdverify.www&#34;]
  * module.track-benefit-appeal.azurerm_dns_cname_record.this[&#34;cdnverify.www&#34;]
  * module.track-benefit-appeal.azurerm_dns_cname_record.this[&#34;www&#34;]
  * module.track-benefit-appeal.azurerm_dns_zone.zone
  * module.track-benefit-appeal.azurerm_role_assignment.dnszonecontributer
  * module.tribunalsdecisions.azurerm_dns_a_record.this[&#34;@&#34;]
  * module.tribunalsdecisions.azurerm_dns_cname_record.this[&#34;27626045&#34;]
  * module.tribunalsdecisions.azurerm_dns_cname_record.this[&#34;em5456&#34;]
  * module.tribunalsdecisions.azurerm_dns_cname_record.this[&#34;s1._domainkey&#34;]
  * module.tribunalsdecisions.azurerm_dns_cname_record.this[&#34;s2._domainkey&#34;]
  * module.tribunalsdecisions.azurerm_dns_cname_record.this[&#34;url3746&#34;]
  * module.tribunalsdecisions.azurerm_dns_zone.zone
  * module.tribunalsdecisions.azurerm_role_assignment.dnszonecontributer
  * module.vh.azurerm_dns_a_record.this[&#34;px01&#34;]
  * module.vh.azurerm_dns_a_record.this[&#34;px02&#34;]
  * module.vh.azurerm_dns_a_record.this[&#34;sip&#34;]
  * module.vh.azurerm_dns_a_record.this[&#34;test&#34;]
  * module.vh.azurerm_dns_cname_record.this[&#34;_4E5364004532ACECCFE1D7B1B1E2D414.px01&#34;]
  * module.vh.azurerm_dns_cname_record.this[&#34;_4E5364004532ACECCFE1D7B1B1E2D414.px02&#34;]
  * module.vh.azurerm_dns_cname_record.this[&#34;_4E5364004532ACECCFE1D7B1B1E2D414.sip&#34;]
  * module.vh.azurerm_dns_srv_record.this[&#34;_h323cs._tcp&#34;]
  * module.vh.azurerm_dns_srv_record.this[&#34;_h323ls._udp&#34;]
  * module.vh.azurerm_dns_srv_record.this[&#34;_h323rs._udp&#34;]
  * module.vh.azurerm_dns_srv_record.this[&#34;sip._tcp&#34;]
  * module.vh.azurerm_dns_srv_record.this[&#34;sips._tcp&#34;]
  * module.vh.azurerm_dns_zone.zone
  * module.vh.azurerm_role_assignment.dnszonecontributer




<details><summary>Change Result (Click me)</summary>

```hcl

  # module.appeal-benefit.azurerm_dns_cname_record.this["afdverify.www"] will be created
  + resource "azurerm_dns_cname_record" "this" {
      + fqdn                = (known after apply)
      + id                  = (known after apply)
      + name                = "afdverify.www"
      + record              = "afdverify.hmcts-prod.azurefd.net"
      + resource_group_name = "reformmgmtrg"
      + ttl                 = 300
      + zone_name           = "appeal-benefit-decision.service.gov.uk"
    }

  # module.appeal-benefit.azurerm_dns_cname_record.this["afdverify.www.manage"] will be created
  + resource "azurerm_dns_cname_record" "this" {
      + fqdn                = (known after apply)
      + id                  = (known after apply)
      + name                = "afdverify.www.manage"
      + record              = "afdverify.hmcts-prod.azurefd.net"
      + resource_group_name = "reformmgmtrg"
      + ttl                 = 300
      + zone_name           = "appeal-benefit-decision.service.gov.uk"
    }

  # module.appeal-benefit.azurerm_dns_cname_record.this["cdnverify.www"] will be created
  + resource "azurerm_dns_cname_record" "this" {
      + fqdn                = (known after apply)
      + id                  = (known after apply)
      + name                = "cdnverify.www"
      + record              = "cdnverify.hmcts-appeal-benefit-decision-shutter-prod.azureedge.net"
      + resource_group_name = "reformmgmtrg"
      + ttl                 = 300
      + zone_name           = "appeal-benefit-decision.service.gov.uk"
    }

  # module.appeal-benefit.azurerm_dns_cname_record.this["cdnverify.www.manage"] will be created
  + resource "azurerm_dns_cname_record" "this" {
      + fqdn                = (known after apply)
      + id                  = (known after apply)
      + name                = "cdnverify.www.manage"
      + record              = "cdnverify.hmcts-manage-shutter-prod.azureedge.net"
      + resource_group_name = "reformmgmtrg"
      + ttl                 = 300
      + zone_name           = "appeal-benefit-decision.service.gov.uk"
    }

  # module.appeal-benefit.azurerm_dns_cname_record.this["manage"] will be created
  + resource "azurerm_dns_cname_record" "this" {
      + fqdn                = (known after apply)
      + id                  = (known after apply)
      + name                = "manage"
      + record              = "www.manage.appeal-benefit-decision.service.gov.uk"
      + resource_group_name = "reformmgmtrg"
      + ttl                 = 300
      + zone_name           = "appeal-benefit-decision.service.gov.uk"
    }

  # module.appeal-benefit.azurerm_dns_cname_record.this["www"] will be created
  + resource "azurerm_dns_cname_record" "this" {
      + fqdn                = (known after apply)
      + id                  = (known after apply)
      + name                = "www"
      + record              = "hmcts-prod.azurefd.net"
      + resource_group_name = "reformmgmtrg"
      + ttl                 = 300
      + zone_name           = "appeal-benefit-decision.service.gov.uk"
    }

  # module.appeal-benefit.azurerm_dns_cname_record.this["www.manage"] will be created
  + resource "azurerm_dns_cname_record" "this" {
      + fqdn                = (known after apply)
      + id                  = (known after apply)
      + name                = "www.manage"
      + record              = "hmcts-prod.azurefd.net"
      + resource_group_name = "reformmgmtrg"
      + ttl                 = 300
      + zone_name           = "appeal-benefit-decision.service.gov.uk"
    }

  # module.appeal-benefit.azurerm_dns_zone.zone will be created
  + resource "azurerm_dns_zone" "zone" {
      + id                        = (known after apply)
      + max_number_of_record_sets = (known after apply)
      + name                      = "appeal-benefit-decision.service.gov.uk"
      + name_servers              = (known after apply)
      + number_of_record_sets     = (known after apply)
      + resource_group_name       = "reformMgmtRG"

      + soa_record {
          + email         = (known after apply)
          + expire_time   = (known after apply)
          + fqdn          = (known after apply)
          + host_name     = (known after apply)
          + minimum_ttl   = (known after apply)
          + refresh_time  = (known after apply)
          + retry_time    = (known after apply)
          + serial_number = (known after apply)
          + tags          = (known after apply)
          + ttl           = (known after apply)
        }
    }

  # module.appeal-benefit.azurerm_role_assignment.dnszonecontributer will be created
  + resource "azurerm_role_assignment" "dnszonecontributer" {
      + id                               = (known after apply)
      + name                             = (known after apply)
      + principal_id                     = "2608a08f-b9d5-45a8-b641-207f574a0b60"
      + principal_type                   = (known after apply)
      + role_definition_id               = (known after apply)
      + role_definition_name             = "DNS Zone Contributor"
      + scope                            = (known after apply)
      + skip_service_principal_aad_check = (known after apply)
    }

  # module.appeal-immigration.azurerm_dns_cname_record.this["afdverify.www"] will be created
  + resource "azurerm_dns_cname_record" "this" {
      + fqdn                = (known after apply)
      + id                  = (known after apply)
      + name                = "afdverify.www"
      + record              = "afdverify.hmcts-prod.azurefd.net"
      + resource_group_name = "reformmgmtrg"
      + ttl                 = 300
      + zone_name           = "appeal-immigration-asylum-decision.service.gov.uk"
    }

  # module.appeal-immigration.azurerm_dns_cname_record.this["cdnverify.www"] will be created
  + resource "azurerm_dns_cname_record" "this" {
      + fqdn                = (known after apply)
      + id                  = (known after apply)
      + name                = "cdnverify.www"
      + record              = "cdnverify.hmcts-appeal-immigration-asylum-decision-shutter.azureedge.net"
      + resource_group_name = "reformmgmtrg"
      + ttl                 = 300
      + zone_name           = "appeal-immigration-asylum-decision.service.gov.uk"
    }

  # module.appeal-immigration.azurerm_dns_cname_record.this["www"] will be created
  + resource "azurerm_dns_cname_record" "this" {
      + fqdn                = (known after apply)
      + id                  = (known after apply)
      + name                = "www"
      + record              = "hmcts-prod.azurefd.net"
      + resource_group_name = "reformmgmtrg"
      + ttl                 = 60
      + zone_name           = "appeal-immigration-asylum-decision.service.gov.uk"
    }

  # module.appeal-immigration.azurerm_dns_zone.zone will be created
  + resource "azurerm_dns_zone" "zone" {
      + id                        = (known after apply)
      + max_number_of_record_sets = (known after apply)
      + name                      = "appeal-immigration-asylum-decision.service.gov.uk"
      + name_servers              = (known after apply)
      + number_of_record_sets     = (known after apply)
      + resource_group_name       = "reformMgmtRG"

      + soa_record {
          + email         = (known after apply)
          + expire_time   = (known after apply)
          + fqdn          = (known after apply)
          + host_name     = (known after apply)
          + minimum_ttl   = (known after apply)
          + refresh_time  = (known after apply)
          + retry_time    = (known after apply)
          + serial_number = (known after apply)
          + tags          = (known after apply)
          + ttl           = (known after apply)
        }
    }

  # module.appeal-immigration.azurerm_role_assignment.dnszonecontributer will be created
  + resource "azurerm_role_assignment" "dnszonecontributer" {
      + id                               = (known after apply)
      + name                             = (known after apply)
      + principal_id                     = "2608a08f-b9d5-45a8-b641-207f574a0b60"
      + principal_type                   = (known after apply)
      + role_definition_id               = (known after apply)
      + role_definition_name             = "DNS Zone Contributor"
      + scope                            = (known after apply)
      + skip_service_principal_aad_check = (known after apply)
    }

  # module.apply-divorce.azurerm_dns_cname_record.this["*"] will be created
  + resource "azurerm_dns_cname_record" "this" {
      + fqdn                = (known after apply)
      + id                  = (known after apply)
      + name                = "*"
      + record              = "www.apply-divorce.service.gov.uk"
      + resource_group_name = "reformmgmtrg"
      + ttl                 = 60
      + zone_name           = "apply-divorce.service.gov.uk"
    }

  # module.apply-divorce.azurerm_dns_cname_record.this["afdverify.www"] will be created
  + resource "azurerm_dns_cname_record" "this" {
      + fqdn                = (known after apply)
      + id                  = (known after apply)
      + name                = "afdverify.www"
      + record              = "afdverify.hmcts-prod.azurefd.net"
      + resource_group_name = "reformmgmtrg"
      + ttl                 = 3600
      + zone_name           = "apply-divorce.service.gov.uk"
    }

  # module.apply-divorce.azurerm_dns_cname_record.this["afdverify.www.decree-absolute"] will be created
  + resource "azurerm_dns_cname_record" "this" {
      + fqdn                = (known after apply)
      + id                  = (known after apply)
      + name                = "afdverify.www.decree-absolute"
      + record              = "afdverify.hmcts-prod.azurefd.net"
      + resource_group_name = "reformmgmtrg"
      + ttl                 = 3600
      + zone_name           = "apply-divorce.service.gov.uk"
    }

  # module.apply-divorce.azurerm_dns_cname_record.this["afdverify.www.decree-nisi"] will be created
  + resource "azurerm_dns_cname_record" "this" {
      + fqdn                = (known after apply)
      + id                  = (known after apply)
      + name                = "afdverify.www.decree-nisi"
      + record              = "afdverify.hmcts-prod.azurefd.net"
      + resource_group_name = "reformmgmtrg"
      + ttl                 = 3600
      + zone_name           = "apply-divorce.service.gov.uk"
    }

  # module.apply-divorce.azurerm_dns_cname_record.this["afdverify.www.manage-application"] will be created
  + resource "azurerm_dns_cname_record" "this" {
      + fqdn                = (known after apply)
      + id                  = (known after apply)
      + name                = "afdverify.www.manage-application"
      + record              = "afdverify.hmcts-prod.azurefd.net"
      + resource_group_name = "reformmgmtrg"
      + ttl                 = 3600
      + zone_name           = "apply-divorce.service.gov.uk"
    }

  # module.apply-divorce.azurerm_dns_cname_record.this["cdnverify.www"] will be created
  + resource "azurerm_dns_cname_record" "this" {
      + fqdn                = (known after apply)
      + id                  = (known after apply)
      + name                = "cdnverify.www"
      + record              = "cdnverify.hmcts-apply-divorce-shutter-prod.azureedge.net"
      + resource_group_name = "reformmgmtrg"
      + ttl                 = 3600
      + zone_name           = "apply-divorce.service.gov.uk"
    }

  # module.apply-divorce.azurerm_dns_cname_record.this["cdnverify.www.decree-absolute"] will be created
  + resource "azurerm_dns_cname_record" "this" {
      + fqdn                = (known after apply)
      + id                  = (known after apply)
      + name                = "cdnverify.www.decree-absolute"
      + record              = "cdnverify.hmcts-decree-absolute-shutter-prod.azureedge.net"
      + resource_group_name = "reformmgmtrg"
      + ttl                 = 3600
      + zone_name           = "apply-divorce.service.gov.uk"
    }

  # module.apply-divorce.azurerm_dns_cname_record.this["cdnverify.www.decree-nisi"] will be created
  + resource "azurerm_dns_cname_record" "this" {
      + fqdn                = (known after apply)
      + id                  = (known after apply)
      + name                = "cdnverify.www.decree-nisi"
      + record              = "cdnverify.hmcts-decree-nisi-shutter-prod.azureedge.net"
      + resource_group_name = "reformmgmtrg"
      + ttl                 = 3600
      + zone_name           = "apply-divorce.service.gov.uk"
    }

  # module.apply-divorce.azurerm_dns_cname_record.this["cdnverify.www.manage-application"] will be created
  + resource "azurerm_dns_cname_record" "this" {
      + fqdn                = (known after apply)
      + id                  = (known after apply)
      + name                = "cdnverify.www.manage-application"
      + record              = "cdnverify.hmcts-manage-application-shutter-prod.azureedge.net"
      + resource_group_name = "reformmgmtrg"
      + ttl                 = 3600
      + zone_name           = "apply-divorce.service.gov.uk"
    }

  # module.apply-divorce.azurerm_dns_cname_record.this["decree-absolute"] will be created
  + resource "azurerm_dns_cname_record" "this" {
      + fqdn                = (known after apply)
      + id                  = (known after apply)
      + name                = "decree-absolute"
      + record              = "www.decree-absolute.apply-divorce.service.gov.uk"
      + resource_group_name = "reformmgmtrg"
      + ttl                 = 300
      + zone_name           = "apply-divorce.service.gov.uk"
    }

  # module.apply-divorce.azurerm_dns_cname_record.this["decree-nisi"] will be created
  + resource "azurerm_dns_cname_record" "this" {
      + fqdn                = (known after apply)
      + id                  = (known after apply)
      + name                = "decree-nisi"
      + record              = "www.decree-nisi.apply-divorce.service.gov.uk"
      + resource_group_name = "reformmgmtrg"
      + ttl                 = 300
      + zone_name           = "apply-divorce.service.gov.uk"
    }

  # module.apply-divorce.azurerm_dns_cname_record.this["manage-application"] will be created
  + resource "azurerm_dns_cname_record" "this" {
      + fqdn                = (known after apply)
      + id                  = (known after apply)
      + name                = "manage-application"
      + record              = "www.manage-application.apply-divorce.service.gov.uk"
      + resource_group_name = "reformmgmtrg"
      + ttl                 = 300
      + zone_name           = "apply-divorce.service.gov.uk"
    }

  # module.apply-divorce.azurerm_dns_cname_record.this["www"] will be created
  + resource "azurerm_dns_cname_record" "this" {
      + fqdn                = (known after apply)
      + id                  = (known after apply)
      + name                = "www"
      + record              = "hmcts-prod.azurefd.net"
      + resource_group_name = "reformmgmtrg"
      + ttl                 = 120
      + zone_name           = "apply-divorce.service.gov.uk"
    }

  # module.apply-divorce.azurerm_dns_cname_record.this["www.decree-absolute"] will be created
  + resource "azurerm_dns_cname_record" "this" {
      + fqdn                = (known after apply)
      + id                  = (known after apply)
      + name                = "www.decree-absolute"
      + record              = "hmcts-prod.azurefd.net"
      + resource_group_name = "reformmgmtrg"
      + ttl                 = 300
      + zone_name           = "apply-divorce.service.gov.uk"
    }

  # module.apply-divorce.azurerm_dns_cname_record.this["www.decree-nisi"] will be created
  + resource "azurerm_dns_cname_record" "this" {
      + fqdn                = (known after apply)
      + id                  = (known after apply)
      + name                = "www.decree-nisi"
      + record              = "hmcts-prod.azurefd.net"
      + resource_group_name = "reformmgmtrg"
      + ttl                 = 300
      + zone_name           = "apply-divorce.service.gov.uk"
    }

  # module.apply-divorce.azurerm_dns_cname_record.this["www.manage-application"] will be created
  + resource "azurerm_dns_cname_record" "this" {
      + fqdn                = (known after apply)
      + id                  = (known after apply)
      + name                = "www.manage-application"
      + record              = "hmcts-prod.azurefd.net"
      + resource_group_name = "reformmgmtrg"
      + ttl                 = 300
      + zone_name           = "apply-divorce.service.gov.uk"
    }

  # module.apply-divorce.azurerm_dns_txt_record.this["_dnsauth.www"] will be created
  + resource "azurerm_dns_txt_record" "this" {
      + fqdn                = (known after apply)
      + id                  = (known after apply)
      + name                = "_dnsauth.www"
      + resource_group_name = "reformmgmtrg"
      + ttl                 = 3600
      + zone_name           = "apply-divorce.service.gov.uk"

      + record {
          + value = "5bz95ky3c27gb6475yz0yx2x1g4wg6qc"
        }
    }

  # module.apply-divorce.azurerm_dns_zone.zone will be created
  + resource "azurerm_dns_zone" "zone" {
      + id                        = (known after apply)
      + max_number_of_record_sets = (known after apply)
      + name                      = "apply-divorce.service.gov.uk"
      + name_servers              = (known after apply)
      + number_of_record_sets     = (known after apply)
      + resource_group_name       = "reformMgmtRG"

      + soa_record {
          + email         = (known after apply)
          + expire_time   = (known after apply)
          + fqdn          = (known after apply)
          + host_name     = (known after apply)
          + minimum_ttl   = (known after apply)
          + refresh_time  = (known after apply)
          + retry_time    = (known after apply)
          + serial_number = (known after apply)
          + tags          = (known after apply)
          + ttl           = (known after apply)
        }
    }

  # module.apply-divorce.azurerm_role_assignment.dnszonecontributer will be created
  + resource "azurerm_role_assignment" "dnszonecontributer" {
      + id                               = (known after apply)
      + name                             = (known after apply)
      + principal_id                     = "2608a08f-b9d5-45a8-b641-207f574a0b60"
      + principal_type                   = (known after apply)
      + role_definition_id               = (known after apply)
      + role_definition_name             = "DNS Zone Contributor"
      + scope                            = (known after apply)
      + skip_service_principal_aad_check = (known after apply)
    }

  # module.apply-for-probate.azurerm_dns_a_record.this["@"] will be created
  + resource "azurerm_dns_a_record" "this" {
      + fqdn                = (known after apply)
      + id                  = (known after apply)
      + name                = "@"
      + records             = [
          + "51.140.162.48",
        ]
      + resource_group_name = "reformmgmtrg"
      + ttl                 = 3600
      + zone_name           = "apply-for-probate.service.gov.uk"
    }

  # module.apply-for-probate.azurerm_dns_cname_record.this["afdverify.www"] will be created
  + resource "azurerm_dns_cname_record" "this" {
      + fqdn                = (known after apply)
      + id                  = (known after apply)
      + name                = "afdverify.www"
      + record              = "afdverify.hmcts-prod.azurefd.net"
      + resource_group_name = "reformmgmtrg"
      + ttl                 = 300
      + zone_name           = "apply-for-probate.service.gov.uk"
    }

  # module.apply-for-probate.azurerm_dns_cname_record.this["cdnverify.www"] will be created
  + resource "azurerm_dns_cname_record" "this" {
      + fqdn         

# ...
# ... The maximum length of GitHub Comment is 65536, so the content is omitted by tfcmt.
# ...

ole_assignment" "dnszonecontributer" {
      + id                               = (known after apply)
      + name                             = (known after apply)
      + principal_id                     = "2608a08f-b9d5-45a8-b641-207f574a0b60"
      + principal_type                   = (known after apply)
      + role_definition_id               = (known after apply)
      + role_definition_name             = "DNS Zone Contributor"
      + scope                            = (known after apply)
      + skip_service_principal_aad_check = (known after apply)
    }

  # module.sftp-hmcts.azurerm_dns_cname_record.this["_AA8EC07175CE288A9960578BF8864075.bais-ext"] will be created
  + resource "azurerm_dns_cname_record" "this" {
      + fqdn                = (known after apply)
      + id                  = (known after apply)
      + name                = "_aa8ec07175ce288a9960578bf8864075.bais-ext"
      + record              = "2E090DA2F60F56F93C6369D374D29616.86304B9AA08FB25B75F196B2BEA0141E.e76d88aeab47da20d61b.comodoca.com."
      + resource_group_name = "reformmgmtrg"
      + ttl                 = 300
      + zone_name           = "sftp.hmcts.net"
    }

  # module.sftp-hmcts.azurerm_dns_cname_record.this["_D724A636D0EE8CF0CE02188391A736F7.bais-ext-stg"] will be created
  + resource "azurerm_dns_cname_record" "this" {
      + fqdn                = (known after apply)
      + id                  = (known after apply)
      + name                = "_d724a636d0ee8cf0ce02188391a736f7.bais-ext-stg"
      + record              = "1C9E9A09BA32A30906853C082674F610.68B38A4FC46492AA87E30E0DF515EB8D.b4bf04d0f6c635d8b2d7.comodoca.com."
      + resource_group_name = "reformmgmtrg"
      + ttl                 = 300
      + zone_name           = "sftp.hmcts.net"
    }

  # module.sftp-hmcts.azurerm_dns_zone.zone will be created
  + resource "azurerm_dns_zone" "zone" {
      + id                        = (known after apply)
      + max_number_of_record_sets = (known after apply)
      + name                      = "sftp.hmcts.net"
      + name_servers              = (known after apply)
      + number_of_record_sets     = (known after apply)
      + resource_group_name       = "reformMgmtRG"

      + soa_record {
          + email         = (known after apply)
          + expire_time   = (known after apply)
          + fqdn          = (known after apply)
          + host_name     = (known after apply)
          + minimum_ttl   = (known after apply)
          + refresh_time  = (known after apply)
          + retry_time    = (known after apply)
          + serial_number = (known after apply)
          + tags          = (known after apply)
          + ttl           = (known after apply)
        }
    }

  # module.sftp-hmcts.azurerm_role_assignment.dnszonecontributer will be created
  + resource "azurerm_role_assignment" "dnszonecontributer" {
      + id                               = (known after apply)
      + name                             = (known after apply)
      + principal_id                     = "2608a08f-b9d5-45a8-b641-207f574a0b60"
      + principal_type                   = (known after apply)
      + role_definition_id               = (known after apply)
      + role_definition_name             = "DNS Zone Contributor"
      + scope                            = (known after apply)
      + skip_service_principal_aad_check = (known after apply)
    }

  # module.track-benefit-appeal.azurerm_dns_cname_record.this["afdverify.www"] will be created
  + resource "azurerm_dns_cname_record" "this" {
      + fqdn                = (known after apply)
      + id                  = (known after apply)
      + name                = "afdverify.www"
      + record              = "afdverify.hmcts-prod.azurefd.net"
      + resource_group_name = "reformmgmtrg"
      + ttl                 = 300
      + zone_name           = "track-benefit-appeal.service.gov.uk"
    }

  # module.track-benefit-appeal.azurerm_dns_cname_record.this["cdnverify.www"] will be created
  + resource "azurerm_dns_cname_record" "this" {
      + fqdn                = (known after apply)
      + id                  = (known after apply)
      + name                = "cdnverify.www"
      + record              = "cdnverify.hmcts-track-benefit-appeal-shutter-prod.azureedge.net"
      + resource_group_name = "reformmgmtrg"
      + ttl                 = 300
      + zone_name           = "track-benefit-appeal.service.gov.uk"
    }

  # module.track-benefit-appeal.azurerm_dns_cname_record.this["www"] will be created
  + resource "azurerm_dns_cname_record" "this" {
      + fqdn                = (known after apply)
      + id                  = (known after apply)
      + name                = "www"
      + record              = "hmcts-prod.azurefd.net"
      + resource_group_name = "reformmgmtrg"
      + ttl                 = 300
      + zone_name           = "track-benefit-appeal.service.gov.uk"
    }

  # module.track-benefit-appeal.azurerm_dns_zone.zone will be created
  + resource "azurerm_dns_zone" "zone" {
      + id                        = (known after apply)
      + max_number_of_record_sets = (known after apply)
      + name                      = "track-benefit-appeal.service.gov.uk"
      + name_servers              = (known after apply)
      + number_of_record_sets     = (known after apply)
      + resource_group_name       = "reformMgmtRG"

      + soa_record {
          + email         = (known after apply)
          + expire_time   = (known after apply)
          + fqdn          = (known after apply)
          + host_name     = (known after apply)
          + minimum_ttl   = (known after apply)
          + refresh_time  = (known after apply)
          + retry_time    = (known after apply)
          + serial_number = (known after apply)
          + tags          = (known after apply)
          + ttl           = (known after apply)
        }
    }

  # module.track-benefit-appeal.azurerm_role_assignment.dnszonecontributer will be created
  + resource "azurerm_role_assignment" "dnszonecontributer" {
      + id                               = (known after apply)
      + name                             = (known after apply)
      + principal_id                     = "2608a08f-b9d5-45a8-b641-207f574a0b60"
      + principal_type                   = (known after apply)
      + role_definition_id               = (known after apply)
      + role_definition_name             = "DNS Zone Contributor"
      + scope                            = (known after apply)
      + skip_service_principal_aad_check = (known after apply)
    }

  # module.tribunalsdecisions.azurerm_dns_a_record.this["@"] will be created
  + resource "azurerm_dns_a_record" "this" {
      + fqdn                = (known after apply)
      + id                  = (known after apply)
      + name                = "@"
      + resource_group_name = "reformmgmtrg"
      + target_resource_id  = "/subscriptions/5ca62022-6aa2-4cee-aaa7-e7536c8d566c/resourceGroups/lz-prod-rg/providers/Microsoft.Network/frontdoors/sdshmcts-prod"
      + ttl                 = 60
      + zone_name           = "tribunalsdecisions.service.gov.uk"
    }

  # module.tribunalsdecisions.azurerm_dns_cname_record.this["27626045"] will be created
  + resource "azurerm_dns_cname_record" "this" {
      + fqdn                = (known after apply)
      + id                  = (known after apply)
      + name                = "27626045"
      + record              = "sendgrid.net"
      + resource_group_name = "reformmgmtrg"
      + ttl                 = 300
      + zone_name           = "tribunalsdecisions.service.gov.uk"
    }

  # module.tribunalsdecisions.azurerm_dns_cname_record.this["em5456"] will be created
  + resource "azurerm_dns_cname_record" "this" {
      + fqdn                = (known after apply)
      + id                  = (known after apply)
      + name                = "em5456"
      + record              = "u27626045.wl046.sendgrid.net"
      + resource_group_name = "reformmgmtrg"
      + ttl                 = 300
      + zone_name           = "tribunalsdecisions.service.gov.uk"
    }

  # module.tribunalsdecisions.azurerm_dns_cname_record.this["s1._domainkey"] will be created
  + resource "azurerm_dns_cname_record" "this" {
      + fqdn                = (known after apply)
      + id                  = (known after apply)
      + name                = "s1._domainkey"
      + record              = "s1.domainkey.u27626045.wl046.sendgrid.net"
      + resource_group_name = "reformmgmtrg"
      + ttl                 = 300
      + zone_name           = "tribunalsdecisions.service.gov.uk"
    }

  # module.tribunalsdecisions.azurerm_dns_cname_record.this["s2._domainkey"] will be created
  + resource "azurerm_dns_cname_record" "this" {
      + fqdn                = (known after apply)
      + id                  = (known after apply)
      + name                = "s2._domainkey"
      + record              = "s2.domainkey.u27626045.wl046.sendgrid.net"
      + resource_group_name = "reformmgmtrg"
      + ttl                 = 300
      + zone_name           = "tribunalsdecisions.service.gov.uk"
    }

  # module.tribunalsdecisions.azurerm_dns_cname_record.this["url3746"] will be created
  + resource "azurerm_dns_cname_record" "this" {
      + fqdn                = (known after apply)
      + id                  = (known after apply)
      + name                = "url3746"
      + record              = "sendgrid.net"
      + resource_group_name = "reformmgmtrg"
      + ttl                 = 300
      + zone_name           = "tribunalsdecisions.service.gov.uk"
    }

  # module.tribunalsdecisions.azurerm_dns_zone.zone will be created
  + resource "azurerm_dns_zone" "zone" {
      + id                        = (known after apply)
      + max_number_of_record_sets = (known after apply)
      + name                      = "tribunalsdecisions.service.gov.uk"
      + name_servers              = (known after apply)
      + number_of_record_sets     = (known after apply)
      + resource_group_name       = "reformMgmtRG"

      + soa_record {
          + email         = (known after apply)
          + expire_time   = (known after apply)
          + fqdn          = (known after apply)
          + host_name     = (known after apply)
          + minimum_ttl   = (known after apply)
          + refresh_time  = (known after apply)
          + retry_time    = (known after apply)
          + serial_number = (known after apply)
          + tags          = (known after apply)
          + ttl           = (known after apply)
        }
    }

  # module.tribunalsdecisions.azurerm_role_assignment.dnszonecontributer will be created
  + resource "azurerm_role_assignment" "dnszonecontributer" {
      + id                               = (known after apply)
      + name                             = (known after apply)
      + principal_id                     = "2608a08f-b9d5-45a8-b641-207f574a0b60"
      + principal_type                   = (known after apply)
      + role_definition_id               = (known after apply)
      + role_definition_name             = "DNS Zone Contributor"
      + scope                            = (known after apply)
      + skip_service_principal_aad_check = (known after apply)
    }

  # module.vh.azurerm_dns_a_record.this["px01"] will be created
  + resource "azurerm_dns_a_record" "this" {
      + fqdn                = (known after apply)
      + id                  = (known after apply)
      + name                = "px01"
      + records             = [
          + "34.89.118.38",
        ]
      + resource_group_name = "reformmgmtrg"
      + ttl                 = 300
      + zone_name           = "vh.hmcts.net"
    }

  # module.vh.azurerm_dns_a_record.this["px02"] will be created
  + resource "azurerm_dns_a_record" "this" {
      + fqdn                = (known after apply)
      + id                  = (known after apply)
      + name                = "px02"
      + records             = [
          + "34.89.63.94",
        ]
      + resource_group_name = "reformmgmtrg"
      + ttl                 = 300
      + zone_name           = "vh.hmcts.net"
    }

  # module.vh.azurerm_dns_a_record.this["sip"] will be created
  + resource "azurerm_dns_a_record" "this" {
      + fqdn                = (known after apply)
      + id                  = (known after apply)
      + name                = "sip"
      + records             = [
          + "34.89.118.38",
          + "34.89.63.94",
        ]
      + resource_group_name = "reformmgmtrg"
      + ttl                 = 300
      + zone_name           = "vh.hmcts.net"
    }

  # module.vh.azurerm_dns_a_record.this["test"] will be created
  + resource "azurerm_dns_a_record" "this" {
      + fqdn                = (known after apply)
      + id                  = (known after apply)
      + name                = "test"
      + records             = [
          + "34.89.63.94",
        ]
      + resource_group_name = "reformmgmtrg"
      + ttl                 = 300
      + zone_name           = "vh.hmcts.net"
    }

  # module.vh.azurerm_dns_cname_record.this["_4E5364004532ACECCFE1D7B1B1E2D414.px01"] will be created
  + resource "azurerm_dns_cname_record" "this" {
      + fqdn                = (known after apply)
      + id                  = (known after apply)
      + name                = "_4e5364004532aceccfe1d7b1b1e2d414.px01"
      + record              = "38F8C27E325F0ECB3B981256EB4C8FDD.B23B9774F924B30E0C871DC3713A2D4F.935a0def48ff0d197932.sectigo.com"
      + resource_group_name = "reformmgmtrg"
      + ttl                 = 10800
      + zone_name           = "vh.hmcts.net"
    }

  # module.vh.azurerm_dns_cname_record.this["_4E5364004532ACECCFE1D7B1B1E2D414.px02"] will be created
  + resource "azurerm_dns_cname_record" "this" {
      + fqdn                = (known after apply)
      + id                  = (known after apply)
      + name                = "_4e5364004532aceccfe1d7b1b1e2d414.px02"
      + record              = "38F8C27E325F0ECB3B981256EB4C8FDD.B23B9774F924B30E0C871DC3713A2D4F.935a0def48ff0d197932.sectigo.com"
      + resource_group_name = "reformmgmtrg"
      + ttl                 = 10800
      + zone_name           = "vh.hmcts.net"
    }

  # module.vh.azurerm_dns_cname_record.this["_4E5364004532ACECCFE1D7B1B1E2D414.sip"] will be created
  + resource "azurerm_dns_cname_record" "this" {
      + fqdn                = (known after apply)
      + id                  = (known after apply)
      + name                = "_4e5364004532aceccfe1d7b1b1e2d414.sip"
      + record              = "38F8C27E325F0ECB3B981256EB4C8FDD.B23B9774F924B30E0C871DC3713A2D4F.935a0def48ff0d197932.sectigo.com"
      + resource_group_name = "reformmgmtrg"
      + ttl                 = 10800
      + zone_name           = "vh.hmcts.net"
    }

  # module.vh.azurerm_dns_srv_record.this["_h323cs._tcp"] will be created
  + resource "azurerm_dns_srv_record" "this" {
      + fqdn                = (known after apply)
      + id                  = (known after apply)
      + name                = "_h323cs._tcp"
      + resource_group_name = "reformmgmtrg"
      + ttl                 = 86400
      + zone_name           = "vh.hmcts.net"

      + record {
          + port     = 1720
          + priority = 10
          + target   = "px01.vh.hmcts.net"
          + weight   = 10
        }
      + record {
          + port     = 1720
          + priority = 10
          + target   = "px02.vh.hmcts.net"
          + weight   = 10
        }
    }

  # module.vh.azurerm_dns_srv_record.this["_h323ls._udp"] will be created
  + resource "azurerm_dns_srv_record" "this" {
      + fqdn                = (known after apply)
      + id                  = (known after apply)
      + name                = "_h323ls._udp"
      + resource_group_name = "reformmgmtrg"
      + ttl                 = 86400
      + zone_name           = "vh.hmcts.net"

      + record {
          + port     = 1719
          + priority = 10
          + target   = "px01.vh.hmcts.net"
          + weight   = 10
        }
      + record {
          + port     = 1719
          + priority = 10
          + target   = "px02.vh.hmcts.net"
          + weight   = 10
        }
    }

  # module.vh.azurerm_dns_srv_record.this["_h323rs._udp"] will be created
  + resource "azurerm_dns_srv_record" "this" {
      + fqdn                = (known after apply)
      + id                  = (known after apply)
      + name                = "_h323rs._udp"
      + resource_group_name = "reformmgmtrg"
      + ttl                 = 86400
      + zone_name           = "vh.hmcts.net"

      + record {
          + port     = 1719
          + priority = 10
          + target   = "px01.vh.hmcts.net"
          + weight   = 10
        }
      + record {
          + port     = 1719
          + priority = 10
          + target   = "px02.vh.hmcts.net"
          + weight   = 10
        }
    }

  # module.vh.azurerm_dns_srv_record.this["sip._tcp"] will be created
  + resource "azurerm_dns_srv_record" "this" {
      + fqdn                = (known after apply)
      + id                  = (known after apply)
      + name                = "sip._tcp"
      + resource_group_name = "reformmgmtrg"
      + ttl                 = 86400
      + zone_name           = "vh.hmcts.net"

      + record {
          + port     = 5060
          + priority = 10
          + target   = "px01.vh.hmcts.net"
          + weight   = 10
        }
      + record {
          + port     = 5060
          + priority = 10
          + target   = "px02.vh.hmcts.net"
          + weight   = 10
        }
    }

  # module.vh.azurerm_dns_srv_record.this["sips._tcp"] will be created
  + resource "azurerm_dns_srv_record" "this" {
      + fqdn                = (known after apply)
      + id                  = (known after apply)
      + name                = "sips._tcp"
      + resource_group_name = "reformmgmtrg"
      + ttl                 = 86400
      + zone_name           = "vh.hmcts.net"

      + record {
          + port     = 5061
          + priority = 10
          + target   = "px01.vh.hmcts.net"
          + weight   = 10
        }
      + record {
          + port     = 5061
          + priority = 10
          + target   = "px02.vh.hmcts.net"
          + weight   = 10
        }
    }

  # module.vh.azurerm_dns_zone.zone will be created
  + resource "azurerm_dns_zone" "zone" {
      + id                        = (known after apply)
      + max_number_of_record_sets = (known after apply)
      + name                      = "vh.hmcts.net"
      + name_servers              = (known after apply)
      + number_of_record_sets     = (known after apply)
      + resource_group_name       = "reformMgmtRG"

      + soa_record {
          + email         = (known after apply)
          + expire_time   = (known after apply)
          + fqdn          = (known after apply)
          + host_name     = (known after apply)
          + minimum_ttl   = (known after apply)
          + refresh_time  = (known after apply)
          + retry_time    = (known after apply)
          + serial_number = (known after apply)
          + tags          = (known after apply)
          + ttl           = (known after apply)
        }
    }

  # module.vh.azurerm_role_assignment.dnszonecontributer will be created
  + resource "azurerm_role_assignment" "dnszonecontributer" {
      + id                               = (known after apply)
      + name                             = (known after apply)
      + principal_id                     = "2608a08f-b9d5-45a8-b641-207f574a0b60"
      + principal_type                   = (known after apply)
      + role_definition_id               = (known after apply)
      + role_definition_name             = "DNS Zone Contributor"
      + scope                            = (known after apply)
      + skip_service_principal_aad_check = (known after apply)
    }

Plan: 635 to add, 0 to change, 0 to destroy.
```

</details>





<!-- github-comment: {"Command":"plan","PRNumber":958,"Program":"tfcmt","SHA1":"","Target":"prod-uksouth-prod","Vars":{}} -->